<abi-corpus path='libmultipath-nv.so' architecture='elf-amd-x86_64' soname='libmultipath-nv.so'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libdevmapper.so.1.02.1'/>
    <dependency name='libudev.so.1'/>
    <dependency name='libmpathcmd.so.0'/>
    <dependency name='libmount.so.1'/>
    <dependency name='liburcu.so.6'/>
    <dependency name='libaio.so.1'/>
    <dependency name='libsystemd.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='__snprint_config' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dm_flush_map' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_print_multipath_topology' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_snprint_multipath' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_snprint_multipath_topology' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='timespeccmp' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='timespecsub' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='trigger_path_udev_change' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='trigger_paths_udev_change' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='truncate_strbuf' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uevent_dispatch' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uevent_get_dm_str' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uevent_get_env_positive_int' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uevent_is_mpath' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uevent_listen' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uninit_config' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='update_mpp_paths' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='update_multipath_strings' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='update_multipath_table' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='update_queue_mode_add_path' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='update_queue_mode_del_path' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ux_socket_listen' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='valid_alias' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_alloc' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_alloc_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_del_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_free' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_reset' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_set_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='verify_paths' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libmp_verbosity' size='4' version='NOVERSION' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='logsink' size='4' version='NOVERSION' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='udev' size='8' version='NOVERSION' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='parser.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='type-id-1'/>
    <type-decl name='char' size-in-bits='8' id='type-id-2'/>
    <qualified-type-def type-id='type-id-2' const='yes' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <function-decl name='is_quote' mangled-name='is_quote' filepath='/build/libmultipath/parser.c' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_quote@@NOVERSION'>
      <parameter type-id='type-id-4' name='token' filepath='/build/libmultipath/parser.c' line='198' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='_vector' size-in-bits='128' is-struct='yes' visibility='default' filepath='/build/libmultipath/vector.h' line='29' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocated' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/vector.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='slot' type-id='type-id-7' visibility='default' filepath='/build/libmultipath/vector.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-6'/>
    <type-decl name='void' id='type-id-8'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-10'/>
    <typedef-decl name='vector' type-id='type-id-10' filepath='/build/libmultipath/vector.h' line='33' column='1' id='type-id-11'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-12'/>
    <function-decl name='alloc_strvec' mangled-name='alloc_strvec' filepath='/build/libmultipath/parser.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_strvec@@NOVERSION'>
      <parameter type-id='type-id-12' name='string' filepath='/build/libmultipath/parser.c' line='206' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dlog' mangled-name='dlog' filepath='/build/libmultipath/debug.h' line='3' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strerror' mangled-name='strerror' filepath='/usr/include/string.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen' filepath='/usr/include/stdio.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__fgets_alias' mangled-name='fgets' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strtok_r' mangled-name='strtok_r' filepath='/usr/include/string.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_alloc' mangled-name='vector_alloc' filepath='/build/libmultipath/vector.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_strvec' mangled-name='free_strvec' filepath='/build/libmultipath/vector.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_free' mangled-name='vector_free' filepath='/build/libmultipath/vector.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_strncat' mangled-name='strncat' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='realloc' mangled-name='realloc' filepath='/usr/include/stdlib.h' line='550' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__sigsetjmp' mangled-name='__sigsetjmp' filepath='/usr/include/pthread.h' line='719' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__pthread_register_cancel' mangled-name='__pthread_register_cancel' filepath='/usr/include/pthread.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__pthread_unregister_cancel' mangled-name='__pthread_unregister_cancel' filepath='/usr/include/pthread.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__pthread_unwind_next' mangled-name='__pthread_unwind_next' filepath='/usr/include/pthread.h' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__append_strbuf_str' mangled-name='__append_strbuf_str' filepath='/build/libmultipath/strbuf.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_strbuf_len' mangled-name='get_strbuf_len' filepath='/build/libmultipath/strbuf.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_strbuf_str' mangled-name='get_strbuf_str' filepath='/build/libmultipath/strbuf.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='reset_strbuf' mangled-name='reset_strbuf' filepath='/build/libmultipath/strbuf.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='append_strbuf_str' mangled-name='append_strbuf_str' filepath='/build/libmultipath/strbuf.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_multipath_config' mangled-name='get_multipath_config' filepath='/build/libmultipath/config.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_alloc_slot' mangled-name='vector_alloc_slot' filepath='/build/libmultipath/vector.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_set_slot' mangled-name='vector_set_slot' filepath='/build/libmultipath/vector.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strstr' mangled-name='strstr' filepath='/usr/include/string.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' filepath='/usr/include/string.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='vector.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='vector_set_slot' mangled-name='vector_set_slot' filepath='/build/libmultipath/vector.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_set_slot@@NOVERSION'>
      <parameter type-id='type-id-11' name='v' filepath='/build/libmultipath/vector.c' line='190' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='/build/libmultipath/vector.c' line='190' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_strvec' mangled-name='free_strvec' filepath='/build/libmultipath/vector.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_strvec@@NOVERSION'>
      <parameter type-id='type-id-11' name='strvec' filepath='/build/libmultipath/vector.c' line='173' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_free' mangled-name='vector_free' filepath='/build/libmultipath/vector.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_free@@NOVERSION'>
      <parameter type-id='type-id-11' name='v' filepath='/build/libmultipath/vector.c' line='165' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_reset' mangled-name='vector_reset' filepath='/build/libmultipath/vector.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_reset@@NOVERSION'>
      <parameter type-id='type-id-11' name='v' filepath='/build/libmultipath/vector.c' line='150' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='vector_del_slot' mangled-name='vector_del_slot' filepath='/build/libmultipath/vector.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_del_slot@@NOVERSION'>
      <parameter type-id='type-id-11' name='v' filepath='/build/libmultipath/vector.c' line='109' column='1'/>
      <parameter type-id='type-id-6' name='slot' filepath='/build/libmultipath/vector.c' line='109' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_alloc' mangled-name='vector_alloc' filepath='/build/libmultipath/vector.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_alloc@@NOVERSION'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='vector_alloc_slot' mangled-name='vector_alloc_slot' filepath='/build/libmultipath/vector.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_alloc_slot@@NOVERSION'>
      <parameter type-id='type-id-11' name='v' filepath='/build/libmultipath/vector.c' line='39' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='find_slot' mangled-name='find_slot' filepath='/build/libmultipath/vector.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_slot@@NOVERSION'>
      <parameter type-id='type-id-11' name='v' filepath='/build/libmultipath/vector.c' line='94' column='1'/>
      <parameter type-id='type-id-9' name='addr' filepath='/build/libmultipath/vector.c' line='94' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='msort' mangled-name='msort' filepath='/build/libmultipath/msort.h' line='4' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='devmapper.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='dm_reassign' mangled-name='dm_reassign' filepath='/build/libmultipath/devmapper.c' line='1776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_reassign@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1776' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='multipath' size-in-bits='5056' is-struct='yes' visibility='default' filepath='/build/libmultipath/structs.h' line='386' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wwid' type-id='type-id-14' visibility='default' filepath='/build/libmultipath/structs.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='alias_old' type-id='type-id-14' visibility='default' filepath='/build/libmultipath/structs.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='pgpolicy' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='pgpolicyfn' type-id='type-id-15' visibility='default' filepath='/build/libmultipath/structs.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nextpg' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='bestpg' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='queuedio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='action' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='wait_for_udev' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='uev_wait_tick' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='pgfailback' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='failback_tick' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='rr_weight' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='no_path_retry' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='retry_tick' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='disable_queueing' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='minio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='flush_on_last_del' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='attribute_flags' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='retain_hwhandler' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='deferred_remove' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='in_recovery' type-id='type-id-1' visibility='default' filepath='/build/libmultipath/structs.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2728'>
        <var-decl name='need_reload' type-id='type-id-1' visibility='default' filepath='/build/libmultipath/structs.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='san_path_err_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='san_path_err_forget_rate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='san_path_err_recovery_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='marginal_path_err_sample_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='marginal_path_err_rate_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='marginal_path_err_recheck_gap_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='marginal_path_double_failed_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='skip_kpartx' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='max_sectors_kb' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='force_readonly' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='force_udev_reload' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='needs_paths_uevent' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='ghost_delay' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='ghost_delay_tick' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='queue_mode' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='uid' type-id='type-id-16' visibility='default' filepath='/build/libmultipath/structs.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='gid' type-id='type-id-17' visibility='default' filepath='/build/libmultipath/structs.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='mode' type-id='type-id-18' visibility='default' filepath='/build/libmultipath/structs.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='size' type-id='type-id-19' visibility='default' filepath='/build/libmultipath/structs.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='paths' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/structs.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='pg' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/structs.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='dmi' type-id='type-id-20' visibility='default' filepath='/build/libmultipath/structs.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='alias' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/structs.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='alias_prefix' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/structs.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='selector' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/structs.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='features' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/structs.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='hwhandler' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/structs.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='mpe' type-id='type-id-21' visibility='default' filepath='/build/libmultipath/structs.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='hwe' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/structs.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='waiter' type-id='type-id-22' visibility='default' filepath='/build/libmultipath/structs.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='stat_switchgroup' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='stat_path_failures' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='stat_map_loads' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='stat_total_queueing_time' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='stat_queueing_timeouts' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='stat_map_failures' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='mpcontext' type-id='type-id-9' visibility='default' filepath='/build/libmultipath/structs.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='prkey_source' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='reservation_key' type-id='type-id-24' visibility='default' filepath='/build/libmultipath/structs.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='sa_flags' type-id='type-id-25' visibility='default' filepath='/build/libmultipath/structs.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='prflag' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='all_tg_pt' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='generic_mp' type-id='type-id-26' visibility='default' filepath='/build/libmultipath/structs.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='fpin_must_reload' type-id='type-id-1' visibility='default' filepath='/build/libmultipath/structs.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-27'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='1024' id='type-id-14'>
      <subrange length='128' type-id='type-id-27' id='type-id-28'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-29'/>
    <typedef-decl name='pgpolicyfn' type-id='type-id-30' filepath='/build/libmultipath/structs.h' line='377' column='1' id='type-id-31'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-15'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-23'/>
    <typedef-decl name='__uid_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='146' column='1' id='type-id-32'/>
    <typedef-decl name='uid_t' type-id='type-id-32' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-16'/>
    <typedef-decl name='__gid_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='147' column='1' id='type-id-33'/>
    <typedef-decl name='gid_t' type-id='type-id-33' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='64' column='1' id='type-id-17'/>
    <typedef-decl name='__mode_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-34'/>
    <typedef-decl name='mode_t' type-id='type-id-34' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='69' column='1' id='type-id-18'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-19'/>
    <class-decl name='dm_info' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/libdevmapper.h' line='147' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exists' type-id='type-id-6' visibility='default' filepath='/usr/include/libdevmapper.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='suspended' type-id='type-id-6' visibility='default' filepath='/usr/include/libdevmapper.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='live_table' type-id='type-id-6' visibility='default' filepath='/usr/include/libdevmapper.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='inactive_table' type-id='type-id-6' visibility='default' filepath='/usr/include/libdevmapper.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='open_count' type-id='type-id-35' visibility='default' filepath='/usr/include/libdevmapper.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='event_nr' type-id='type-id-36' visibility='default' filepath='/usr/include/libdevmapper.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='major' type-id='type-id-36' visibility='default' filepath='/usr/include/libdevmapper.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='minor' type-id='type-id-36' visibility='default' filepath='/usr/include/libdevmapper.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='read_only' type-id='type-id-6' visibility='default' filepath='/usr/include/libdevmapper.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='target_count' type-id='type-id-35' visibility='default' filepath='/usr/include/libdevmapper.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deferred_remove' type-id='type-id-6' visibility='default' filepath='/usr/include/libdevmapper.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='internal_suspend' type-id='type-id-6' visibility='default' filepath='/usr/include/libdevmapper.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-37'/>
    <typedef-decl name='int32_t' type-id='type-id-37' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-35'/>
    <typedef-decl name='__uint32_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-38'/>
    <typedef-decl name='uint32_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-36'/>
    <class-decl name='mpentry' size-in-bits='1408' is-struct='yes' visibility='default' filepath='/build/libmultipath/config.h' line='99' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wwid' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alias' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uid_attribute' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='selector' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='features' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='prio_name' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='prio_args' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='prkey_source' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='reservation_key' type-id='type-id-24' visibility='default' filepath='/build/libmultipath/config.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sa_flags' type-id='type-id-25' visibility='default' filepath='/build/libmultipath/config.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='pgpolicy' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pgfailback' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='rr_weight' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='no_path_retry' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='minio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='minio_rq' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='flush_on_last_del' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='attribute_flags' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='user_friendly_names' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='deferred_remove' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='delay_watch_checks' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='delay_wait_checks' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='san_path_err_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='san_path_err_forget_rate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='san_path_err_recovery_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='marginal_path_err_sample_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='marginal_path_err_rate_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='marginal_path_err_recheck_gap_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='marginal_path_double_failed_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='skip_kpartx' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='max_sectors_kb' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ghost_delay' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='uid' type-id='type-id-16' visibility='default' filepath='/build/libmultipath/config.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='gid' type-id='type-id-17' visibility='default' filepath='/build/libmultipath/config.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='mode' type-id='type-id-18' visibility='default' filepath='/build/libmultipath/config.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='be64' size-in-bits='64' is-struct='yes' visibility='default' filepath='/build/libmultipath/byteorder.h' line='36' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_v' type-id='type-id-40' visibility='default' filepath='/build/libmultipath/byteorder.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='type-id-27' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-41'/>
    <typedef-decl name='uint64_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-40'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-42'/>
    <typedef-decl name='__uint8_t' type-id='type-id-42' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-43'/>
    <typedef-decl name='uint8_t' type-id='type-id-43' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-25'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-21'/>
    <typedef-decl name='pthread_t' type-id='type-id-27' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='27' column='1' id='type-id-22'/>
    <class-decl name='gen_multipath' size-in-bits='64' is-struct='yes' visibility='default' filepath='/build/libmultipath/generic.h' line='117' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='type-id-44' visibility='default' filepath='/build/libmultipath/generic.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gen_multipath_ops' size-in-bits='256' is-struct='yes' visibility='default' filepath='/build/libmultipath/generic.h' line='37' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='get_pathgroups' type-id='type-id-46' visibility='default' filepath='/build/libmultipath/generic.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rel_pathgroups' type-id='type-id-47' visibility='default' filepath='/build/libmultipath/generic.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='snprint' type-id='type-id-48' visibility='default' filepath='/build/libmultipath/generic.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style' type-id='type-id-49' visibility='default' filepath='/build/libmultipath/generic.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-47'/>
    <class-decl name='strbuf' size-in-bits='192' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-49'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-44'/>
    <function-decl name='dm_cancel_deferred_remove' mangled-name='dm_cancel_deferred_remove' filepath='/build/libmultipath/devmapper.c' line='1567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_cancel_deferred_remove@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/devmapper.c' line='1567' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_mapname' mangled-name='dm_mapname' filepath='/build/libmultipath/devmapper.c' line='1398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_mapname@@NOVERSION'>
      <parameter type-id='type-id-6' name='major' filepath='/build/libmultipath/devmapper.c' line='1398' column='1'/>
      <parameter type-id='type-id-6' name='minor' filepath='/build/libmultipath/devmapper.c' line='1398' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='dm_geteventnr' mangled-name='dm_geteventnr' filepath='/build/libmultipath/devmapper.c' line='1376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_geteventnr@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='1376' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_get_maps' mangled-name='dm_get_maps' filepath='/build/libmultipath/devmapper.c' line='1319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_get_maps@@NOVERSION'>
      <parameter type-id='type-id-11' name='mp' filepath='/build/libmultipath/devmapper.c' line='1319' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_get_multipath' mangled-name='dm_get_multipath' filepath='/build/libmultipath/devmapper.c' line='1291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_get_multipath@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='1291' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='dm_enablegroup' mangled-name='dm_enablegroup' filepath='/build/libmultipath/devmapper.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_enablegroup@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1280' column='1'/>
      <parameter type-id='type-id-6' name='index' filepath='/build/libmultipath/devmapper.c' line='1280' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_switchgroup' mangled-name='dm_switchgroup' filepath='/build/libmultipath/devmapper.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_switchgroup@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1280' column='1'/>
      <parameter type-id='type-id-6' name='index' filepath='/build/libmultipath/devmapper.c' line='1280' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_queue_if_no_path' mangled-name='dm_queue_if_no_path' filepath='/build/libmultipath/devmapper.c' line='1250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_queue_if_no_path@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1250' column='1'/>
      <parameter type-id='type-id-6' name='enable' filepath='/build/libmultipath/devmapper.c' line='1250' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_reinstate_path' mangled-name='dm_reinstate_path' filepath='/build/libmultipath/devmapper.c' line='1239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_reinstate_path@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1239' column='1'/>
      <parameter type-id='type-id-12' name='path' filepath='/build/libmultipath/devmapper.c' line='1239' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_fail_path' mangled-name='dm_fail_path' filepath='/build/libmultipath/devmapper.c' line='1228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_fail_path@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1239' column='1'/>
      <parameter type-id='type-id-12' name='path' filepath='/build/libmultipath/devmapper.c' line='1239' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_flush_maps' mangled-name='dm_flush_maps' filepath='/build/libmultipath/devmapper.c' line='1155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_flush_maps@@NOVERSION'>
      <parameter type-id='type-id-6' name='need_suspend' filepath='/build/libmultipath/devmapper.c' line='1155' column='1'/>
      <parameter type-id='type-id-6' name='retries' filepath='/build/libmultipath/devmapper.c' line='1155' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_flush_map_nopaths' mangled-name='dm_flush_map_nopaths' filepath='/build/libmultipath/devmapper.c' line='1139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_flush_map_nopaths@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1280' column='1'/>
      <parameter type-id='type-id-6' name='index' filepath='/build/libmultipath/devmapper.c' line='1280' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_dm_flush_map' mangled-name='_dm_flush_map' filepath='/build/libmultipath/devmapper.c' line='1057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_dm_flush_map@@NOVERSION'>
      <parameter type-id='type-id-4' name='mapname' filepath='/build/libmultipath/devmapper.c' line='1057' column='1'/>
      <parameter type-id='type-id-6' name='need_sync' filepath='/build/libmultipath/devmapper.c' line='1057' column='1'/>
      <parameter type-id='type-id-6' name='deferred_remove' filepath='/build/libmultipath/devmapper.c' line='1057' column='1'/>
      <parameter type-id='type-id-6' name='need_suspend' filepath='/build/libmultipath/devmapper.c' line='1058' column='1'/>
      <parameter type-id='type-id-6' name='retries' filepath='/build/libmultipath/devmapper.c' line='1058' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-61'/>
    <function-decl name='dm_get_major_minor' mangled-name='dm_get_major_minor' filepath='/build/libmultipath/devmapper.c' line='1018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_get_major_minor@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='1018' column='1'/>
      <parameter type-id='type-id-61' name='major' filepath='/build/libmultipath/devmapper.c' line='1018' column='1'/>
      <parameter type-id='type-id-61' name='minor' filepath='/build/libmultipath/devmapper.c' line='1018' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_is_mpath' mangled-name='dm_is_mpath' filepath='/build/libmultipath/devmapper.c' line='872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_is_mpath@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='872' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_get_uuid' mangled-name='dm_get_uuid' filepath='/build/libmultipath/devmapper.c' line='735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_get_uuid@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='735' column='1'/>
      <parameter type-id='type-id-12' name='uuid' filepath='/build/libmultipath/devmapper.c' line='735' column='1'/>
      <parameter type-id='type-id-6' name='uuid_len' filepath='/build/libmultipath/devmapper.c' line='735' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_map_present' mangled-name='dm_map_present' filepath='/build/libmultipath/devmapper.c' line='651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_map_present@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='1376' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-62'/>
    <function-decl name='dm_get_info' mangled-name='dm_get_info' filepath='/build/libmultipath/devmapper.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_get_info@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='618' column='1'/>
      <parameter type-id='type-id-62' name='info' filepath='/build/libmultipath/devmapper.c' line='618' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-63'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-64'/>
    <function-decl name='has_dm_info' mangled-name='has_dm_info' filepath='/build/libmultipath/devmapper.c' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='has_dm_info@@NOVERSION'>
      <parameter type-id='type-id-64' name='mpp' filepath='/build/libmultipath/devmapper.c' line='612' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-65'/>
    <typedef-decl name='__uint16_t' type-id='type-id-65' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-66'/>
    <typedef-decl name='uint16_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-67'/>
    <function-decl name='dm_simplecmd_noflush' mangled-name='dm_simplecmd_noflush' filepath='/build/libmultipath/devmapper.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_simplecmd_noflush@@NOVERSION'>
      <parameter type-id='type-id-6' name='task' filepath='/build/libmultipath/devmapper.c' line='435' column='1'/>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/devmapper.c' line='435' column='1'/>
      <parameter type-id='type-id-67' name='udev_flags' filepath='/build/libmultipath/devmapper.c' line='435' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <class-decl name='dm_task' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <function-decl name='libmp_dm_task_create' mangled-name='libmp_dm_task_create' filepath='/build/libmultipath/devmapper.c' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libmp_dm_task_create@@NOVERSION'>
      <parameter type-id='type-id-6' name='task' filepath='/build/libmultipath/devmapper.c' line='380' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='skip_libmp_dm_init' mangled-name='skip_libmp_dm_init' filepath='/build/libmultipath/devmapper.c' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skip_libmp_dm_init@@NOVERSION'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libmp_udev_set_sync_support' mangled-name='libmp_udev_set_sync_support' filepath='/build/libmultipath/devmapper.c' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libmp_udev_set_sync_support@@NOVERSION'>
      <parameter type-id='type-id-6' name='on' filepath='/build/libmultipath/devmapper.c' line='337' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-70'/>
    <function-decl name='libmp_get_version' mangled-name='libmp_get_version' filepath='/build/libmultipath/devmapper.c' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libmp_get_version@@NOVERSION'>
      <parameter type-id='type-id-6' name='which' filepath='/build/libmultipath/devmapper.c' line='305' column='1'/>
      <parameter type-id='type-id-70' name='version' filepath='/build/libmultipath/devmapper.c' line='305' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='libmp_dm_task_run' mangled-name='libmp_dm_task_run' filepath='/build/libmultipath/devmapper.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libmp_dm_task_run@@NOVERSION'>
      <parameter type-id='type-id-69' name='dmt' filepath='/build/libmultipath/devmapper.c' line='83' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_prereq' mangled-name='dm_prereq' filepath='/build/libmultipath/devmapper.c' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dm_prereq@@NOVERSION'>
      <parameter type-id='type-id-70' name='v' filepath='/build/libmultipath/devmapper.c' line='296' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='dm_task_get_errno' mangled-name='dm_task_get_errno' filepath='/usr/include/libdevmapper.h' line='1451' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin___snprintf_chk' mangled-name='__snprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='first_path' mangled-name='first_path' filepath='/build/libmultipath/structs.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_name' mangled-name='dm_task_set_name' filepath='/usr/include/libdevmapper.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_destroy' mangled-name='dm_task_destroy' filepath='/usr/include/libdevmapper.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_no_open_count' mangled-name='dm_task_no_open_count' filepath='/usr/include/libdevmapper.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_geometry' mangled-name='dm_task_set_geometry' filepath='/usr/include/libdevmapper.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin___sprintf_chk' mangled-name='__sprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_get_info' mangled-name='dm_task_get_info' filepath='/usr/include/libdevmapper.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_get_deps' mangled-name='dm_task_get_deps' filepath='/usr/include/libdevmapper.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_check_holders' mangled-name='sysfs_check_holders' filepath='/build/libmultipath/sysfs.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_add_target' mangled-name='dm_task_add_target' filepath='/usr/include/libdevmapper.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_get_next_target' mangled-name='dm_get_next_target' filepath='/usr/include/libdevmapper.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_strcpy' mangled-name='strcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_strcat' mangled-name='strcat' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_newname' mangled-name='dm_task_set_newname' filepath='/usr/include/libdevmapper.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_cookie' mangled-name='dm_task_set_cookie' filepath='/usr/include/libdevmapper.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__asprintf_chk' mangled-name='__asprintf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_get_names' mangled-name='dm_task_get_names' filepath='/usr/include/libdevmapper.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_major' mangled-name='dm_task_set_major' filepath='/usr/include/libdevmapper.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_minor' mangled-name='dm_task_set_minor' filepath='/usr/include/libdevmapper.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_get_name' mangled-name='dm_task_get_name' filepath='/usr/include/libdevmapper.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_multipath' mangled-name='free_multipath' filepath='/build/libmultipath/structs.h' line='515' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_multipath' mangled-name='alloc_multipath' filepath='/build/libmultipath/structs.h' line='508' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_sector' mangled-name='dm_task_set_sector' filepath='/usr/include/libdevmapper.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_message' mangled-name='dm_task_set_message' filepath='/usr/include/libdevmapper.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sleep' mangled-name='sleep' filepath='/usr/include/unistd.h' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_uuid' mangled-name='dm_task_set_uuid' filepath='/usr/include/libdevmapper.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_get_uuid' mangled-name='dm_task_get_uuid' filepath='/usr/include/libdevmapper.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='/build/libmultipath/util.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='count_active_pending_paths' mangled-name='count_active_pending_paths' filepath='/build/libmultipath/structs.h' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='unmark_failed_wwid' mangled-name='unmark_failed_wwid' filepath='/build/libmultipath/wwids.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mark_failed_wwid' mangled-name='mark_failed_wwid' filepath='/build/libmultipath/wwids.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_skip_lockfs' mangled-name='dm_task_skip_lockfs' filepath='/usr/include/libdevmapper.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_no_flush' mangled-name='dm_task_no_flush' filepath='/usr/include/libdevmapper.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_deferred_remove' mangled-name='dm_task_deferred_remove' filepath='/usr/include/libdevmapper.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_once' mangled-name='pthread_once' filepath='/usr/include/pthread.h' line='470' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_create' mangled-name='dm_task_create' filepath='/usr/include/libdevmapper.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_log_init' mangled-name='dm_log_init' filepath='/usr/include/libdevmapper.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_hold_control_dev' mangled-name='dm_hold_control_dev' filepath='/usr/include/libdevmapper.h' line='1569' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_udev_set_sync_support' mangled-name='dm_udev_set_sync_support' filepath='/usr/include/libdevmapper.h' line='3732' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' filepath='/usr/include/stdlib.h' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_get_library_version' mangled-name='dm_get_library_version' filepath='/usr/include/libdevmapper.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' filepath='/usr/include/stdio.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_driver_version' mangled-name='dm_driver_version' filepath='/usr/include/libdevmapper.h' line='1575' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_get_versions' mangled-name='dm_task_get_versions' filepath='/usr/include/libdevmapper.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_monotonic_time' mangled-name='get_monotonic_time' filepath='/build/libmultipath/time-util.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__vfprintf_chk' mangled-name='__vfprintf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_safe' mangled-name='log_safe' filepath='/build/libmultipath/log_pthread.h' line='6' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_run' mangled-name='dm_task_run' filepath='/usr/include/libdevmapper.h' line='1446' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='738' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_udev_wait' mangled-name='dm_udev_wait' filepath='/usr/include/libdevmapper.h' line='3743' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_ro' mangled-name='dm_task_set_ro' filepath='/usr/include/libdevmapper.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_gid' mangled-name='dm_task_set_gid' filepath='/usr/include/libdevmapper.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_mode' mangled-name='dm_task_set_mode' filepath='/usr/include/libdevmapper.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_task_set_uid' mangled-name='dm_task_set_uid' filepath='/usr/include/libdevmapper.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-54'>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-58'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-59'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-30'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-55'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hwtable.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='store_hwe' mangled-name='store_hwe' filepath='/build/libmultipath/config.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='blacklist.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <class-decl name='config' size-in-bits='4096' is-struct='yes' visibility='default' filepath='/build/libmultipath/config.h' line='138' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rcu' type-id='type-id-72' visibility='default' filepath='/build/libmultipath/config.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='verbosity' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pgpolicy_flag' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pgpolicy' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='minio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='minio_rq' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='checkint' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/config.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_checkint' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/config.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='use_watchdog' type-id='type-id-1' visibility='default' filepath='/build/libmultipath/config.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pgfailback' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='rr_weight' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='no_path_retry' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='user_friendly_names' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bindings_read_only' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='max_fds' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='force_reload' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='queue_without_daemon' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='checker_timeout' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='flush_on_last_del' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='attribute_flags' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='fast_io_fail' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dev_loss' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/config.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='eh_deadline' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='log_checker_err' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='allow_queueing' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='allow_usb_devices' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='find_multipaths' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='uid' type-id='type-id-16' visibility='default' filepath='/build/libmultipath/config.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='gid' type-id='type-id-17' visibility='default' filepath='/build/libmultipath/config.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='mode' type-id='type-id-18' visibility='default' filepath='/build/libmultipath/config.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='reassign_maps' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='retain_hwhandler' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='detect_prio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='detect_checker' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='force_sync' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='deferred_remove' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='processed_main_config' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='delay_watch_checks' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='delay_wait_checks' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='san_path_err_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='san_path_err_forget_rate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='san_path_err_recovery_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='marginal_path_err_sample_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='marginal_path_err_rate_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='marginal_path_err_recheck_gap_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='marginal_path_double_failed_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='uxsock_timeout' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='strict_timing' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='retrigger_tries' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='retrigger_delay' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='uev_wait_timeout' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='skip_kpartx' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='remove_retries' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='max_sectors_kb' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='ghost_delay' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='find_multipaths_timeout' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='marginal_pathgroups' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='skip_delegate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='sequence_nr' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/config.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='recheck_wwid' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='selector' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='uid_attrs' type-id='type-id-5' visibility='default' filepath='/build/libmultipath/config.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='uid_attribute' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='features' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='hwhandler' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='bindings_file' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='wwids_file' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='prkeys_file' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='prio_name' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='prio_args' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='checker_name' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='alias_prefix' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='partition_delim' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='prkey_source' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='all_tg_pt' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='reservation_key' type-id='type-id-24' visibility='default' filepath='/build/libmultipath/config.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='sa_flags' type-id='type-id-25' visibility='default' filepath='/build/libmultipath/config.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='keywords' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='mptable' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='hwtable' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='overrides' type-id='type-id-73' visibility='default' filepath='/build/libmultipath/config.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='blist_devnode' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='blist_wwid' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='blist_device' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='blist_property' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='blist_protocol' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='elist_devnode' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='elist_wwid' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='elist_device' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='elist_property' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='elist_protocol' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='enable_foreign' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='233' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rcu_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/call-rcu.h' line='57' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-74' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/call-rcu.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='func' type-id='type-id-75' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/call-rcu.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cds_wfcq_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/wfcqueue.h' line='59' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-76' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/wfcqueue.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-75'/>
    <class-decl name='hwentry' size-in-bits='1792' is-struct='yes' visibility='default' filepath='/build/libmultipath/config.h' line='51' column='1' id='type-id-79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vendor' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='revision' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uid_attribute' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='features' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='hwhandler' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='selector' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='checker_name' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prio_name' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='prio_args' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='alias_prefix' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pgpolicy' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='pgfailback' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='rr_weight' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='no_path_retry' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='minio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='minio_rq' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='flush_on_last_del' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='fast_io_fail' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dev_loss' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/config.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='eh_deadline' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user_friendly_names' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='retain_hwhandler' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='detect_prio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='detect_checker' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='deferred_remove' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='delay_watch_checks' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='delay_wait_checks' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='san_path_err_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='san_path_err_forget_rate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='san_path_err_recovery_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='marginal_path_err_sample_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='marginal_path_err_rate_threshold' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='marginal_path_err_recheck_gap_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='marginal_path_double_failed_time' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='skip_kpartx' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='max_sectors_kb' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='ghost_delay' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='all_tg_pt' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='vpd_vendor_id' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='recheck_wwid' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/config.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='bl_product' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/config.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='pctable' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/config.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-73'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-81'/>
    <class-decl name='path' size-in-bits='11648' is-struct='yes' visibility='default' filepath='/build/libmultipath/structs.h' line='321' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev' type-id='type-id-83' visibility='default' filepath='/build/libmultipath/structs.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='dev_t' type-id='type-id-84' visibility='default' filepath='/build/libmultipath/structs.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='udev' type-id='type-id-85' visibility='default' filepath='/build/libmultipath/structs.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='sg_id' type-id='type-id-86' visibility='default' filepath='/build/libmultipath/structs.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='geom' type-id='type-id-87' visibility='default' filepath='/build/libmultipath/structs.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='wwid' type-id='type-id-14' visibility='default' filepath='/build/libmultipath/structs.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='vendor_id' type-id='type-id-88' visibility='default' filepath='/build/libmultipath/structs.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3976'>
        <var-decl name='product_id' type-id='type-id-89' visibility='default' filepath='/build/libmultipath/structs.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4304'>
        <var-decl name='rev' type-id='type-id-88' visibility='default' filepath='/build/libmultipath/structs.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4376'>
        <var-decl name='serial' type-id='type-id-14' visibility='default' filepath='/build/libmultipath/structs.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5400'>
        <var-decl name='tgt_node_name' type-id='type-id-90' visibility='default' filepath='/build/libmultipath/structs.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='vpd_data' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/structs.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='size' type-id='type-id-19' visibility='default' filepath='/build/libmultipath/structs.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='checkint' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7392'>
        <var-decl name='tick' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='bus' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7456'>
        <var-decl name='offline' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='state' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7520'>
        <var-decl name='dmstate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='chkrstate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7584'>
        <var-decl name='failcount' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7616'>
        <var-decl name='priority' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7648'>
        <var-decl name='pgindex' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='detect_prio' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7712'>
        <var-decl name='detect_checker' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='tpgs' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='uid_attribute' type-id='type-id-4' visibility='default' filepath='/build/libmultipath/structs.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='prio' type-id='type-id-91' visibility='default' filepath='/build/libmultipath/structs.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='checker' type-id='type-id-92' visibility='default' filepath='/build/libmultipath/structs.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='mpp' type-id='type-id-29' visibility='default' filepath='/build/libmultipath/structs.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='fd' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10784'>
        <var-decl name='initialized' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='retriggers' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10848'>
        <var-decl name='partial_retrigger_delay' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='path_failures' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='dis_reinstate_time' type-id='type-id-93' visibility='default' filepath='/build/libmultipath/structs.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='disable_reinstate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11040'>
        <var-decl name='san_path_err_forget_rate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='io_err_dis_reinstate_time' type-id='type-id-93' visibility='default' filepath='/build/libmultipath/structs.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='io_err_disable_reinstate' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11168'>
        <var-decl name='io_err_pathfail_cnt' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='io_err_pathfail_starttime' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11232'>
        <var-decl name='find_multipaths_timeout' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='marginal' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11296'>
        <var-decl name='vpd_vendor_id' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='recheck_wwid' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11360'>
        <var-decl name='fast_io_fail' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11392'>
        <var-decl name='dev_loss' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/structs.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11424'>
        <var-decl name='eh_deadline' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11456'>
        <var-decl name='can_use_env_uid' type-id='type-id-1' visibility='default' filepath='/build/libmultipath/structs.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='hwe' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/structs.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11584'>
        <var-decl name='generic_path' type-id='type-id-94' visibility='default' filepath='/build/libmultipath/structs.h' line='374' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='2048' id='type-id-83'>
      <subrange length='256' type-id='type-id-27' id='type-id-95'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='264' id='type-id-84'>
      <subrange length='33' type-id='type-id-27' id='type-id-96'/>

    </array-type-def>
    <class-decl name='udev_device' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-97'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-85'/>
    <class-decl name='sg_id' size-in-bits='320' is-struct='yes' visibility='default' filepath='/build/libmultipath/structs.h' line='299' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host_no' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='channel' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='scsi_id' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lun' type-id='type-id-40' visibility='default' filepath='/build/libmultipath/structs.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='h_cmd_per_lun' type-id='type-id-98' visibility='default' filepath='/build/libmultipath/structs.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='d_queue_depth' type-id='type-id-98' visibility='default' filepath='/build/libmultipath/structs.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='proto_id' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='transport_id' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='307' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-98'/>
    <class-decl name='hd_geometry' size-in-bits='128' is-struct='yes' visibility='default' filepath='/build/libmultipath/structs.h' line='313' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='heads' type-id='type-id-42' visibility='default' filepath='/build/libmultipath/structs.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sectors' type-id='type-id-42' visibility='default' filepath='/build/libmultipath/structs.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cylinders' type-id='type-id-65' visibility='default' filepath='/build/libmultipath/structs.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start' type-id='type-id-27' visibility='default' filepath='/build/libmultipath/structs.h' line='317' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='72' id='type-id-88'>
      <subrange length='9' type-id='type-id-27' id='type-id-99'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='328' id='type-id-89'>
      <subrange length='41' type-id='type-id-27' id='type-id-100'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='1792' id='type-id-90'>
      <subrange length='224' type-id='type-id-27' id='type-id-101'/>

    </array-type-def>
    <class-decl name='prio' size-in-bits='2496' is-struct='yes' visibility='default' filepath='/build/libmultipath/prio.h' line='46' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-9' visibility='default' filepath='/build/libmultipath/prio.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='refcount' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/prio.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='type-id-102' visibility='default' filepath='/build/libmultipath/prio.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name' type-id='type-id-103' visibility='default' filepath='/build/libmultipath/prio.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='args' type-id='type-id-104' visibility='default' filepath='/build/libmultipath/prio.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='getprio' type-id='type-id-105' visibility='default' filepath='/build/libmultipath/prio.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/build/libmultipath/list.h' line='47' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-106' visibility='default' filepath='/build/libmultipath/list.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-106' visibility='default' filepath='/build/libmultipath/list.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-106'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='128' id='type-id-103'>
      <subrange length='16' type-id='type-id-27' id='type-id-107'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='2040' id='type-id-104'>
      <subrange length='255' type-id='type-id-27' id='type-id-108'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-105'/>
    <class-decl name='checker' size-in-bits='320' is-struct='yes' visibility='default' filepath='/build/libmultipath/checkers.h' line='121' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cls' type-id='type-id-111' visibility='default' filepath='/build/libmultipath/checkers.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fd' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/checkers.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='timeout' type-id='type-id-23' visibility='default' filepath='/build/libmultipath/checkers.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='disable' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/checkers.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='msgid' type-id='type-id-98' visibility='default' filepath='/build/libmultipath/checkers.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='context' type-id='type-id-9' visibility='default' filepath='/build/libmultipath/checkers.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mpcontext' type-id='type-id-7' visibility='default' filepath='/build/libmultipath/checkers.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='checker_class' size-in-bits='896' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-111'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-113'/>
    <typedef-decl name='__time_t' type-id='type-id-113' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-114'/>
    <typedef-decl name='time_t' type-id='type-id-114' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='7' column='1' id='type-id-93'/>
    <class-decl name='gen_path' size-in-bits='64' is-struct='yes' visibility='default' filepath='/build/libmultipath/generic.h' line='125' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='type-id-115' visibility='default' filepath='/build/libmultipath/generic.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gen_path_ops' size-in-bits='64' is-struct='yes' visibility='default' filepath='/build/libmultipath/generic.h' line='108' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='snprint' type-id='type-id-117' visibility='default' filepath='/build/libmultipath/generic.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-118'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <class-decl name='strbuf' size-in-bits='192' is-struct='yes' visibility='default' filepath='/build/libmultipath/strbuf.h' line='10' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/strbuf.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-120' visibility='default' filepath='/build/libmultipath/strbuf.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offs' type-id='type-id-120' visibility='default' filepath='/build/libmultipath/strbuf.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='type-id-27' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-120'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-122'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-115'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <function-decl name='filter_path' mangled-name='filter_path' filepath='/build/libmultipath/blacklist.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='filter_path@@NOVERSION'>
      <parameter type-id='type-id-81' name='conf' filepath='/build/libmultipath/blacklist.c' line='363' column='1'/>
      <parameter type-id='type-id-124' name='pp' filepath='/build/libmultipath/blacklist.c' line='363' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='filter_wwid' mangled-name='filter_wwid' filepath='/build/libmultipath/blacklist.c' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='filter_wwid@@NOVERSION'>
      <parameter type-id='type-id-51' name='blist' filepath='/build/libmultipath/blacklist.c' line='324' column='1'/>
      <parameter type-id='type-id-51' name='elist' filepath='/build/libmultipath/blacklist.c' line='324' column='1'/>
      <parameter type-id='type-id-4' name='wwid' filepath='/build/libmultipath/blacklist.c' line='325' column='1'/>
      <parameter type-id='type-id-4' name='dev' filepath='/build/libmultipath/blacklist.c' line='325' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='filter_devnode' mangled-name='filter_devnode' filepath='/build/libmultipath/blacklist.c' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='filter_devnode@@NOVERSION'>
      <parameter type-id='type-id-51' name='blist' filepath='/build/libmultipath/blacklist.c' line='307' column='1'/>
      <parameter type-id='type-id-51' name='elist' filepath='/build/libmultipath/blacklist.c' line='307' column='1'/>
      <parameter type-id='type-id-4' name='dev' filepath='/build/libmultipath/blacklist.c' line='308' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='vector_del_slot' mangled-name='vector_del_slot' filepath='/build/libmultipath/vector.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='regfree' mangled-name='regfree' filepath='/usr/include/regex.h' line='651' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_properties_list_entry' mangled-name='udev_device_get_properties_list_entry' filepath='/usr/include/libudev.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_name' mangled-name='udev_list_entry_get_name' filepath='/usr/include/libudev.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_next' mangled-name='udev_list_entry_get_next' filepath='/usr/include/libudev.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_sysname' mangled-name='udev_device_get_sysname' filepath='/usr/include/libudev.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='snprint_path_protocol' mangled-name='snprint_path_protocol' filepath='/build/libmultipath/print.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='regcomp' mangled-name='regcomp' filepath='/usr/include/regex.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-121'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-78'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='util.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <function-decl name='cleanup_ucharp' mangled-name='cleanup_ucharp' filepath='/build/libmultipath/util.c' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_ucharp@@NOVERSION'>
      <parameter type-id='type-id-126' name='p' filepath='/build/libmultipath/util.c' line='484' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-127'/>
    <function-decl name='cleanup_charp' mangled-name='cleanup_charp' filepath='/build/libmultipath/util.c' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_charp@@NOVERSION'>
      <parameter type-id='type-id-127' name='p' filepath='/build/libmultipath/util.c' line='479' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='cleanup_mutex' mangled-name='cleanup_mutex' filepath='/build/libmultipath/util.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_mutex@@NOVERSION'>
      <parameter type-id='type-id-9' name='arg' filepath='/build/libmultipath/util.c' line='435' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='close_fd' mangled-name='close_fd' filepath='/build/libmultipath/util.c' line='420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close_fd@@NOVERSION'>
      <parameter type-id='type-id-9' name='arg' filepath='/build/libmultipath/util.c' line='435' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='scandir_result' size-in-bits='128' is-struct='yes' visibility='default' filepath='/build/libmultipath/util.h' line='57' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='di' type-id='type-id-129' visibility='default' filepath='/build/libmultipath/util.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/util.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='22' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-131' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-132' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino_t' type-id='type-id-27' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='148' column='1' id='type-id-131'/>
    <typedef-decl name='__off_t' type-id='type-id-113' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-132'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-134'/>
    <function-decl name='free_scandir_result' mangled-name='free_scandir_result' filepath='/build/libmultipath/util.c' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_scandir_result@@NOVERSION'>
      <parameter type-id='type-id-134' name='res' filepath='/build/libmultipath/util.c' line='411' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <typedef-decl name='__rlim_t' type-id='type-id-27' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='157' column='1' id='type-id-135'/>
    <typedef-decl name='rlim_t' type-id='type-id-135' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='131' column='1' id='type-id-136'/>
    <function-decl name='set_max_fds' mangled-name='set_max_fds' filepath='/build/libmultipath/util.c' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_max_fds@@NOVERSION'>
      <parameter type-id='type-id-136' name='max_fds' filepath='/build/libmultipath/util.c' line='380' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-138'/>
    <function-decl name='parse_prkey_flags' mangled-name='parse_prkey_flags' filepath='/build/libmultipath/util.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='parse_prkey_flags@@NOVERSION'>
      <parameter type-id='type-id-4' name='ptr' filepath='/build/libmultipath/util.c' line='351' column='1'/>
      <parameter type-id='type-id-137' name='prkey' filepath='/build/libmultipath/util.c' line='351' column='1'/>
      <parameter type-id='type-id-138' name='flags' filepath='/build/libmultipath/util.c' line='351' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-139'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-140' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-113' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='448' id='type-id-140'>
      <subrange length='56' type-id='type-id-27' id='type-id-141'/>

    </array-type-def>
    <typedef-decl name='pthread_attr_t' type-id='type-id-139' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='62' column='1' id='type-id-142'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <function-decl name='setup_thread_attr' mangled-name='setup_thread_attr' filepath='/build/libmultipath/util.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setup_thread_attr@@NOVERSION'>
      <parameter type-id='type-id-143' name='attr' filepath='/build/libmultipath/util.c' line='226' column='1'/>
      <parameter type-id='type-id-120' name='stacksize' filepath='/build/libmultipath/util.c' line='226' column='1'/>
      <parameter type-id='type-id-6' name='detached' filepath='/build/libmultipath/util.c' line='226' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='convert_dev' mangled-name='convert_dev' filepath='/build/libmultipath/util.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='convert_dev@@NOVERSION'>
      <parameter type-id='type-id-12' name='name' filepath='/build/libmultipath/util.c' line='195' column='1'/>
      <parameter type-id='type-id-6' name='is_path_device' filepath='/build/libmultipath/util.c' line='195' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <qualified-type-def type-id='type-id-12' restrict='yes' id='type-id-144'/>
    <qualified-type-def type-id='type-id-4' restrict='yes' id='type-id-145'/>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='/build/libmultipath/util.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy@@NOVERSION'>
      <parameter type-id='type-id-144' name='dst' filepath='/build/libmultipath/util.c' line='128' column='1'/>
      <parameter type-id='type-id-145' name='src' filepath='/build/libmultipath/util.c' line='128' column='1'/>
      <parameter type-id='type-id-120' name='size' filepath='/build/libmultipath/util.c' line='128' column='1'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='get_next_string' mangled-name='get_next_string' filepath='/build/libmultipath/util.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_next_string@@NOVERSION'>
      <parameter type-id='type-id-127' name='temp' filepath='/build/libmultipath/util.c' line='76' column='1'/>
      <parameter type-id='type-id-4' name='split_char' filepath='/build/libmultipath/util.c' line='76' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='strchop' mangled-name='strchop' filepath='/build/libmultipath/util.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchop@@NOVERSION'>
      <parameter type-id='type-id-12' name='str' filepath='/build/libmultipath/util.c' line='27' column='1'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' mangled-name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getrlimit' mangled-name='getrlimit' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setrlimit' mangled-name='setrlimit' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='write' mangled-name='write' filepath='/usr/include/unistd.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strspn' mangled-name='strspn' filepath='/usr/include/string.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='strtol' filepath='/usr/include/stdlib.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uname' mangled-name='uname' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strtok' mangled-name='strtok' filepath='/usr/include/string.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__xstat' mangled-name='__xstat' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='opendir' mangled-name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir' filepath='/usr/include/dirent.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='closedir' mangled-name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_attr_init' mangled-name='pthread_attr_init' filepath='/usr/include/pthread.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_attr_setstacksize' mangled-name='pthread_attr_setstacksize' filepath='/usr/include/pthread.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' mangled-name='pthread_attr_setdetachstate' filepath='/usr/include/pthread.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__assert_fail' mangled-name='__assert_fail' filepath='/usr/include/assert.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_new_from_devnum' mangled-name='udev_device_new_from_devnum' filepath='/usr/include/libudev.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_unref' mangled-name='udev_device_unref' filepath='/usr/include/libudev.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strsep' mangled-name='strsep' filepath='/usr/include/string.h' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='basename' mangled-name='basename' filepath='/usr/include/string.h' line='487' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dmparser.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='get_word' mangled-name='get_word' filepath='/build/libmultipath/util.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_pathgroup' mangled-name='alloc_pathgroup' filepath='/build/libmultipath/structs.h' line='507' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='add_pathgroup' mangled-name='add_pathgroup' filepath='/build/libmultipath/structs.h' line='529' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_path_by_devt' mangled-name='find_path_by_devt' filepath='/build/libmultipath/structs.h' line='537' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='store_path' mangled-name='store_path' filepath='/build/libmultipath/structs.h' line='528' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_path' mangled-name='alloc_path' filepath='/build/libmultipath/structs.h' line='506' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_path' mangled-name='free_path' filepath='/build/libmultipath/structs.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_pgvec' mangled-name='free_pgvec' filepath='/build/libmultipath/structs.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_pathgroup' mangled-name='free_pathgroup' filepath='/build/libmultipath/structs.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='print_strbuf' mangled-name='print_strbuf' filepath='/build/libmultipath/strbuf.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='add_feature' mangled-name='add_feature' filepath='/build/libmultipath/structs.h' line='545' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='steal_strbuf_str' mangled-name='steal_strbuf_str' filepath='/build/libmultipath/strbuf.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_linux_version_code' mangled-name='get_linux_version_code' filepath='/build/libmultipath/util.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='structs.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-146'/>

    <array-type-def dimensions='1' type-id='type-id-146' size-in-bits='infinite' id='type-id-147'>
      <subrange length='infinite' id='type-id-148'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-149'/>
    <var-decl name='protocol_name' type-id='type-id-149' visibility='default' filepath='/build/libmultipath/structs.h' line='212' column='1'/>
    <function-decl name='count_active_paths' mangled-name='count_active_paths' filepath='/build/libmultipath/structs.c' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='count_active_paths@@NOVERSION'>
      <parameter type-id='type-id-64' name='mpp' filepath='/build/libmultipath/structs.c' line='551' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pathcount' mangled-name='pathcount' filepath='/build/libmultipath/structs.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pathcount@@NOVERSION'>
      <parameter type-id='type-id-64' name='mpp' filepath='/build/libmultipath/structs.c' line='546' column='1'/>
      <parameter type-id='type-id-6' name='state' filepath='/build/libmultipath/structs.c' line='546' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='find_path_by_devt' mangled-name='find_path_by_devt' filepath='/build/libmultipath/structs.c' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_path_by_devt@@NOVERSION'>
      <parameter type-id='type-id-51' name='pathvec' filepath='/build/libmultipath/structs.c' line='506' column='1'/>
      <parameter type-id='type-id-4' name='dev_t' filepath='/build/libmultipath/structs.c' line='506' column='1'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='find_path_by_dev' mangled-name='find_path_by_dev' filepath='/build/libmultipath/structs.c' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_path_by_dev@@NOVERSION'>
      <parameter type-id='type-id-51' name='pathvec' filepath='/build/libmultipath/structs.c' line='506' column='1'/>
      <parameter type-id='type-id-4' name='dev_t' filepath='/build/libmultipath/structs.c' line='506' column='1'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='find_mp_by_str' mangled-name='find_mp_by_str' filepath='/build/libmultipath/structs.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_mp_by_str@@NOVERSION'>
      <parameter type-id='type-id-51' name='mpvec' filepath='/build/libmultipath/structs.c' line='478' column='1'/>
      <parameter type-id='type-id-4' name='str' filepath='/build/libmultipath/structs.c' line='478' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='find_mp_by_alias' mangled-name='find_mp_by_alias' filepath='/build/libmultipath/structs.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_mp_by_alias@@NOVERSION'>
      <parameter type-id='type-id-51' name='mpvec' filepath='/build/libmultipath/structs.c' line='455' column='1'/>
      <parameter type-id='type-id-4' name='alias' filepath='/build/libmultipath/structs.c' line='455' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='find_mp_by_wwid' mangled-name='find_mp_by_wwid' filepath='/build/libmultipath/structs.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_mp_by_wwid@@NOVERSION'>
      <parameter type-id='type-id-51' name='mpvec' filepath='/build/libmultipath/structs.c' line='439' column='1'/>
      <parameter type-id='type-id-4' name='wwid' filepath='/build/libmultipath/structs.c' line='439' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='store_path' mangled-name='store_path' filepath='/build/libmultipath/structs.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='store_path@@NOVERSION'>
      <parameter type-id='type-id-11' name='pathvec' filepath='/build/libmultipath/structs.c' line='364' column='1'/>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/structs.c' line='364' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-150'/>
    <enum-decl name='free_path_mode' filepath='/build/libmultipath/structs.h' line='42' column='1' id='type-id-151'>
      <underlying-type type-id='type-id-150'/>
      <enumerator name='KEEP_PATHS' value='0'/>
      <enumerator name='FREE_PATHS' value='1'/>
    </enum-decl>
    <function-decl name='free_multipathvec' mangled-name='free_multipathvec' filepath='/build/libmultipath/structs.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_multipathvec@@NOVERSION'>
      <parameter type-id='type-id-11' name='mpvec' filepath='/build/libmultipath/structs.c' line='349' column='1'/>
      <parameter type-id='type-id-151' name='free_paths' filepath='/build/libmultipath/structs.c' line='349' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_multipath' mangled-name='alloc_multipath' filepath='/build/libmultipath/structs.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_multipath@@NOVERSION'>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='free_pathvec' mangled-name='free_pathvec' filepath='/build/libmultipath/structs.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_pathvec@@NOVERSION'>
      <parameter type-id='type-id-11' name='vec' filepath='/build/libmultipath/structs.c' line='183' column='1'/>
      <parameter type-id='type-id-151' name='free_paths' filepath='/build/libmultipath/structs.c' line='183' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_path' mangled-name='alloc_path' filepath='/build/libmultipath/structs.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_path@@NOVERSION'>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='free_path' mangled-name='free_path' filepath='/build/libmultipath/structs.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_path@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/structs.c' line='163' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_multipath' mangled-name='free_multipath' filepath='/build/libmultipath/structs.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_multipath@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/structs.c' line='293' column='1'/>
      <parameter type-id='type-id-151' name='free_paths' filepath='/build/libmultipath/structs.c' line='293' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_mp_by_minor' mangled-name='find_mp_by_minor' filepath='/build/libmultipath/structs.c' line='420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_mp_by_minor@@NOVERSION'>
      <parameter type-id='type-id-51' name='mpvec' filepath='/build/libmultipath/structs.c' line='420' column='1'/>
      <parameter type-id='type-id-23' name='minor' filepath='/build/libmultipath/structs.c' line='420' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strtoul' mangled-name='strtoul' filepath='/usr/include/stdlib.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strchop' mangled-name='strchop' filepath='/build/libmultipath/util.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_put' mangled-name='checker_put' filepath='/build/libmultipath/checkers.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='prio_selected' mangled-name='prio_selected' filepath='/build/libmultipath/prio.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='prio_put' mangled-name='prio_put' filepath='/build/libmultipath/prio.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_clear' mangled-name='checker_clear' filepath='/build/libmultipath/checkers.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='has_dm_info' mangled-name='has_dm_info' filepath='/build/libmultipath/devmapper.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='discovery.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <class-decl name='vpd_vendor_page' size-in-bits='128' is-struct='yes' visibility='default' filepath='/build/libmultipath/structs.h' line='293' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pg' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/structs.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-4' visibility='default' filepath='/build/libmultipath/structs.h' line='295' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-152' size-in-bits='256' id='type-id-153'>
      <subrange length='2' type-id='type-id-27' id='type-id-154'/>

    </array-type-def>
    <var-decl name='vpd_vendor_pages' type-id='type-id-153' visibility='default' filepath='/build/libmultipath/structs.h' line='297' column='1'/>
    <function-decl name='get_uid' mangled-name='get_uid' filepath='/build/libmultipath/discovery.c' line='2223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_uid@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/discovery.c' line='2223' column='1'/>
      <parameter type-id='type-id-6' name='path_state' filepath='/build/libmultipath/discovery.c' line='2223' column='1'/>
      <parameter type-id='type-id-85' name='udev' filepath='/build/libmultipath/discovery.c' line='2223' column='1'/>
      <parameter type-id='type-id-6' name='allow_fallback' filepath='/build/libmultipath/discovery.c' line='2224' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-155'/>
    <function-decl name='get_state' mangled-name='get_state' filepath='/build/libmultipath/discovery.c' line='1920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_state@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/discovery.c' line='1920' column='1'/>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/discovery.c' line='1920' column='1'/>
      <parameter type-id='type-id-6' name='daemon' filepath='/build/libmultipath/discovery.c' line='1920' column='1'/>
      <parameter type-id='type-id-6' name='oldstate' filepath='/build/libmultipath/discovery.c' line='1920' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='path_offline' mangled-name='path_offline' filepath='/build/libmultipath/discovery.c' line='1746' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='path_offline@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/discovery.c' line='1746' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='get_vpd_sgio' mangled-name='get_vpd_sgio' filepath='/build/libmultipath/discovery.c' line='1441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_vpd_sgio@@NOVERSION'>
      <parameter type-id='type-id-6' name='fd' filepath='/build/libmultipath/discovery.c' line='1441' column='1'/>
      <parameter type-id='type-id-6' name='pg' filepath='/build/libmultipath/discovery.c' line='1441' column='1'/>
      <parameter type-id='type-id-6' name='vend_id' filepath='/build/libmultipath/discovery.c' line='1441' column='1'/>
      <parameter type-id='type-id-12' name='str' filepath='/build/libmultipath/discovery.c' line='1441' column='1'/>
      <parameter type-id='type-id-6' name='maxlen' filepath='/build/libmultipath/discovery.c' line='1441' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='path_get_tpgs' mangled-name='path_get_tpgs' filepath='/build/libmultipath/discovery.c' line='1056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='path_get_tpgs@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/discovery.c' line='1056' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='sysfs_get_asymmetric_access_state' mangled-name='sysfs_get_asymmetric_access_state' filepath='/build/libmultipath/discovery.c' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sysfs_get_asymmetric_access_state@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/discovery.c' line='570' column='1'/>
      <parameter type-id='type-id-12' name='buff' filepath='/build/libmultipath/discovery.c' line='570' column='1'/>
      <parameter type-id='type-id-6' name='buflen' filepath='/build/libmultipath/discovery.c' line='570' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='path_discovery' mangled-name='path_discovery' filepath='/build/libmultipath/discovery.c' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='path_discovery@@NOVERSION'>
      <parameter type-id='type-id-11' name='pathvec' filepath='/build/libmultipath/discovery.c' line='172' column='1'/>
      <parameter type-id='type-id-6' name='flag' filepath='/build/libmultipath/discovery.c' line='172' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-156'/>
    <function-decl name='store_pathinfo' mangled-name='store_pathinfo' filepath='/build/libmultipath/discovery.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='store_pathinfo@@NOVERSION'>
      <parameter type-id='type-id-11' name='pathvec' filepath='/build/libmultipath/discovery.c' line='84' column='1'/>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/discovery.c' line='84' column='1'/>
      <parameter type-id='type-id-85' name='udevice' filepath='/build/libmultipath/discovery.c' line='85' column='1'/>
      <parameter type-id='type-id-6' name='flag' filepath='/build/libmultipath/discovery.c' line='85' column='1'/>
      <parameter type-id='type-id-156' name='pp_ptr' filepath='/build/libmultipath/discovery.c' line='85' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='alloc_path_with_pathinfo' mangled-name='alloc_path_with_pathinfo' filepath='/build/libmultipath/discovery.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_path_with_pathinfo@@NOVERSION'>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/discovery.c' line='46' column='1'/>
      <parameter type-id='type-id-85' name='udevice' filepath='/build/libmultipath/discovery.c' line='46' column='1'/>
      <parameter type-id='type-id-4' name='wwid' filepath='/build/libmultipath/discovery.c' line='47' column='1'/>
      <parameter type-id='type-id-6' name='flag' filepath='/build/libmultipath/discovery.c' line='47' column='1'/>
      <parameter type-id='type-id-156' name='pp_ptr' filepath='/build/libmultipath/discovery.c' line='47' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pathinfo' mangled-name='pathinfo' filepath='/build/libmultipath/discovery.c' line='2276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pathinfo@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/discovery.c' line='2276' column='1'/>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/discovery.c' line='2276' column='1'/>
      <parameter type-id='type-id-6' name='mask' filepath='/build/libmultipath/discovery.c' line='2276' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='select_getuid' mangled-name='select_getuid' filepath='/build/libmultipath/propsel.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_recheck_wwid' mangled-name='select_recheck_wwid' filepath='/build/libmultipath/propsel.h' line='10' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_property_value' mangled-name='udev_device_get_property_value' filepath='/usr/include/libudev.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_attr_get_value' mangled-name='sysfs_attr_get_value' filepath='/build/libmultipath/sysfs.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_parent_with_subsystem_devtype' mangled-name='udev_device_get_parent_with_subsystem_devtype' filepath='/usr/include/libudev.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='index' mangled-name='index' filepath='/usr/include/strings.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_subsystem' mangled-name='udev_device_get_subsystem' filepath='/usr/include/libudev.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_parent' mangled-name='udev_device_get_parent' filepath='/usr/include/libudev.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_detect_prio' mangled-name='select_detect_prio' filepath='/build/libmultipath/propsel.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_prio' mangled-name='select_prio' filepath='/build/libmultipath/propsel.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='prio_name' mangled-name='prio_name' filepath='/build/libmultipath/prio.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='prio_getprio' mangled-name='prio_getprio' filepath='/build/libmultipath/prio.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_state_name' mangled-name='checker_state_name' filepath='/build/libmultipath/checkers.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_name' mangled-name='checker_name' filepath='/build/libmultipath/checkers.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_message' mangled-name='checker_message' filepath='/build/libmultipath/checkers.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_clear_message' mangled-name='checker_clear_message' filepath='/build/libmultipath/checkers.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_set_sync' mangled-name='checker_set_sync' filepath='/build/libmultipath/checkers.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_check' mangled-name='checker_check' filepath='/build/libmultipath/checkers.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_set_async' mangled-name='checker_set_async' filepath='/build/libmultipath/checkers.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_detect_checker' mangled-name='select_detect_checker' filepath='/build/libmultipath/propsel.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_checker' mangled-name='select_checker' filepath='/build/libmultipath/propsel.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_set_fd' mangled-name='checker_set_fd' filepath='/build/libmultipath/checkers.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_init' mangled-name='checker_init' filepath='/build/libmultipath/checkers.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_mp_init' mangled-name='checker_mp_init' filepath='/build/libmultipath/checkers.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_hwe' mangled-name='find_hwe' filepath='/build/libmultipath/config.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' mangled-name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__get_strbuf_buf' mangled-name='__get_strbuf_buf' filepath='/build/libmultipath/strbuf.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fill_strbuf' mangled-name='fill_strbuf' filepath='/build/libmultipath/strbuf.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='truncate_strbuf' mangled-name='truncate_strbuf' filepath='/build/libmultipath/strbuf.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='memchr' mangled-name='memchr' filepath='/usr/include/string.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_target_port_group_support' mangled-name='get_target_port_group_support' filepath='prioritizers/alua_rtpg.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_target_port_group' mangled-name='get_target_port_group' filepath='prioritizers/alua_rtpg.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_asymmetric_access_state' mangled-name='get_asymmetric_access_state' filepath='prioritizers/alua_rtpg.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='ioctl' mangled-name='ioctl' filepath='/usr/include/x86_64-linux-gnu/sys/ioctl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_new_from_subsystem_sysname' mangled-name='udev_device_new_from_subsystem_sysname' filepath='/usr/include/libudev.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_attr_set_value' mangled-name='sysfs_attr_set_value' filepath='/build/libmultipath/sysfs.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_fast_io_fail' mangled-name='select_fast_io_fail' filepath='/build/libmultipath/propsel.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_dev_loss' mangled-name='select_dev_loss' filepath='/build/libmultipath/propsel.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_eh_deadline' mangled-name='select_eh_deadline' filepath='/build/libmultipath/propsel.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_log_bitfield_overflow' mangled-name='_log_bitfield_overflow' filepath='/build/libmultipath/util.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='bus_protocol_id' mangled-name='bus_protocol_id' filepath='/build/libmultipath/structs.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_sysattr_value' mangled-name='udev_device_get_sysattr_value' filepath='/usr/include/libudev.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_driver' mangled-name='udev_device_get_driver' filepath='/usr/include/libudev.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_devnum' mangled-name='udev_device_get_devnum' filepath='/usr/include/libudev.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_devtype' mangled-name='udev_device_get_devtype' filepath='/usr/include/libudev.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='should_exit' mangled-name='should_exit' filepath='/build/libmultipath/util.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_new_from_syspath' mangled-name='udev_device_new_from_syspath' filepath='/usr/include/libudev.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_enumerate_new' mangled-name='udev_enumerate_new' filepath='/usr/include/libudev.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_enumerate_add_match_subsystem' mangled-name='udev_enumerate_add_match_subsystem' filepath='/usr/include/libudev.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_enumerate_add_match_is_initialized' mangled-name='udev_enumerate_add_match_is_initialized' filepath='/usr/include/libudev.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_enumerate_scan_devices' mangled-name='udev_enumerate_scan_devices' filepath='/usr/include/libudev.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_enumerate_get_list_entry' mangled-name='udev_enumerate_get_list_entry' filepath='/usr/include/libudev.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_enumerate_unref' mangled-name='udev_enumerate_unref' filepath='/usr/include/libudev.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_snprintf' mangled-name='snprintf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_ref' mangled-name='udev_device_ref' filepath='/usr/include/libudev.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_bin_attr_get_value' mangled-name='sysfs_bin_attr_get_value' filepath='/build/libmultipath/sysfs.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin___memcpy_chk' mangled-name='__memcpy_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='memrchr' mangled-name='memrchr' filepath='/usr/include/string.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='add_foreign' mangled-name='add_foreign' filepath='/build/libmultipath/foreign.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_snprint_path' mangled-name='_snprint_path' filepath='/build/libmultipath/print.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_get_size' mangled-name='sysfs_get_size' filepath='/build/libmultipath/sysfs.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__open_alias' mangled-name='open' filepath='/usr/include/x86_64-linux-gnu/bits/fcntl2.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_vpd_vendor_id' mangled-name='select_vpd_vendor_id' filepath='/build/libmultipath/propsel.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='filter_property' mangled-name='filter_property' filepath='/build/libmultipath/blacklist.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='filter_device' mangled-name='filter_device' filepath='/build/libmultipath/blacklist.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='filter_protocol' mangled-name='filter_protocol' filepath='/build/libmultipath/blacklist.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_get_devnode' mangled-name='udev_device_get_devnode' filepath='/usr/include/libudev.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='filter_devnode' mangled-name='filter_devnode' filepath='/build/libmultipath/blacklist.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='filter_wwid' mangled-name='filter_wwid' filepath='/build/libmultipath/blacklist.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='propsel.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='select_all_tg_pt' mangled-name='select_all_tg_pt' filepath='/build/libmultipath/propsel.c' line='1377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='select_all_tg_pt@@NOVERSION'>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/propsel.c' line='1377' column='1'/>
      <parameter type-id='type-id-29' name='mp' filepath='/build/libmultipath/propsel.c' line='1377' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='select_find_multipaths_timeout' mangled-name='select_find_multipaths_timeout' filepath='/build/libmultipath/propsel.c' line='1352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='select_find_multipaths_timeout@@NOVERSION'>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/propsel.c' line='1352' column='1'/>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/propsel.c' line='1352' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='select_reservation_key' mangled-name='select_reservation_key' filepath='/build/libmultipath/propsel.c' line='922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='select_reservation_key@@NOVERSION'>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/propsel.c' line='922' column='1'/>
      <parameter type-id='type-id-29' name='mp' filepath='/build/libmultipath/propsel.c' line='922' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='select_no_path_retry' mangled-name='select_no_path_retry' filepath='/build/libmultipath/propsel.c' line='790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='select_no_path_retry@@NOVERSION'>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/propsel.c' line='790' column='1'/>
      <parameter type-id='type-id-29' name='mp' filepath='/build/libmultipath/propsel.c' line='790' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='print_off_int_undef' mangled-name='print_off_int_undef' filepath='/build/libmultipath/dict.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libmp_get_version' mangled-name='libmp_get_version' filepath='/build/libmultipath/devmapper.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='print_reservation_key' mangled-name='print_reservation_key' filepath='/build/libmultipath/dict.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_prkey' mangled-name='get_prkey' filepath='/build/libmultipath/prkey.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='print_undef_off_zero' mangled-name='print_undef_off_zero' filepath='/build/libmultipath/dict.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='print_dev_loss' mangled-name='print_dev_loss' filepath='/build/libmultipath/dict.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='print_no_path_retry' mangled-name='print_no_path_retry' filepath='/build/libmultipath/dict.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='prio_get' mangled-name='prio_get' filepath='/build/libmultipath/prio.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='path_get_tpgs' mangled-name='path_get_tpgs' filepath='/build/libmultipath/discovery.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='prio_args' mangled-name='prio_args' filepath='/build/libmultipath/prio.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_mpe' mangled-name='find_mpe' filepath='/build/libmultipath/config.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nvme_id_ctrl_ana' mangled-name='nvme_id_ctrl_ana' filepath='/build/libmultipath/nvme-lib.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_get_asymmetric_access_state' mangled-name='sysfs_get_asymmetric_access_state' filepath='/build/libmultipath/discovery.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='has_uid_fallback' mangled-name='has_uid_fallback' filepath='/build/libmultipath/discovery.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_uid_attribute_by_attrs' mangled-name='get_uid_attribute_by_attrs' filepath='/build/libmultipath/config.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='checker_get' mangled-name='checker_get' filepath='/build/libmultipath/checkers.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_get_timeout' mangled-name='sysfs_get_timeout' filepath='/build/libmultipath/discovery.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='remove_feature' mangled-name='remove_feature' filepath='/build/libmultipath/structs.h' line='546' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='cleanup_free_ptr' mangled-name='cleanup_free_ptr' filepath='/build/libmultipath/util.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_user_friendly_alias' mangled-name='get_user_friendly_alias' filepath='/build/libmultipath/alias.h' line='5' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='use_existing_alias' mangled-name='use_existing_alias' filepath='/build/libmultipath/alias.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_pgpolicy_name' mangled-name='get_pgpolicy_name' filepath='/build/libmultipath/pgpolicies.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='print_pgfailback' mangled-name='print_pgfailback' filepath='/build/libmultipath/dict.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='print_rr_weight' mangled-name='print_rr_weight' filepath='/build/libmultipath/dict.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='is_vpd_page_supported' mangled-name='is_vpd_page_supported' filepath='/build/libmultipath/discovery.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_vpd_sgio' mangled-name='get_vpd_sgio' filepath='/build/libmultipath/discovery.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dict.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='keyword_alloc' mangled-name='keyword_alloc' filepath='/build/libmultipath/parser.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_install_keyword' mangled-name='_install_keyword' filepath='/build/libmultipath/parser.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='install_sublevel' mangled-name='install_sublevel' filepath='/build/libmultipath/parser.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='install_sublevel_end' mangled-name='install_sublevel_end' filepath='/build/libmultipath/parser.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='set_value' mangled-name='set_value' filepath='/build/libmultipath/parser.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='append_strbuf_quoted' mangled-name='append_strbuf_quoted' filepath='/build/libmultipath/strbuf.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_pce' mangled-name='alloc_pce' filepath='/build/libmultipath/config.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_mpe' mangled-name='alloc_mpe' filepath='/build/libmultipath/config.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_mpe' mangled-name='free_mpe' filepath='/build/libmultipath/config.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_hwe' mangled-name='alloc_hwe' filepath='/build/libmultipath/config.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_hwe' mangled-name='free_hwe' filepath='/build/libmultipath/config.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_ble_device' mangled-name='alloc_ble_device' filepath='/build/libmultipath/blacklist.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fscanf' mangled-name='__isoc99_fscanf' filepath='/usr/include/stdio.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='ferror' mangled-name='ferror' filepath='/usr/include/stdio.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_pgpolicy_id' mangled-name='get_pgpolicy_id' filepath='/build/libmultipath/pgpolicies.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getpwnam_r' mangled-name='getpwnam_r' filepath='/usr/include/pwd.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_reset' mangled-name='vector_reset' filepath='/build/libmultipath/vector.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='parse_uid_attrs' mangled-name='parse_uid_attrs' filepath='/build/libmultipath/config.h' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='parse_prkey_flags' mangled-name='parse_prkey_flags' filepath='/build/libmultipath/util.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='set_ble_device' mangled-name='set_ble_device' filepath='/build/libmultipath/blacklist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='store_ble' mangled-name='store_ble' filepath='/build/libmultipath/blacklist.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='pgpolicies.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='group_by_prio' mangled-name='group_by_prio' filepath='/build/libmultipath/pgpolicies.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='group_by_prio@@NOVERSION'>
      <parameter type-id='type-id-29' name='mp' filepath='/build/libmultipath/pgpolicies.c' line='277' column='1'/>
      <parameter type-id='type-id-11' name='paths' filepath='/build/libmultipath/pgpolicies.c' line='277' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='get_pgpolicy_id' mangled-name='get_pgpolicy_id' filepath='/build/libmultipath/pgpolicies.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_pgpolicy_id@@NOVERSION'>
      <parameter type-id='type-id-12' name='str' filepath='/build/libmultipath/pgpolicies.c' line='16' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='alloc_bitfield' mangled-name='alloc_bitfield' filepath='/build/libmultipath/util.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='path_group_prio_update' mangled-name='path_group_prio_update' filepath='/build/libmultipath/switchgroup.h' line='1' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_move_up' mangled-name='vector_move_up' filepath='/build/libmultipath/vector.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='debug.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <var-decl name='logsink' type-id='type-id-6' mangled-name='logsink' visibility='default' filepath='/build/libmultipath/debug.h' line='12' column='1' elf-symbol-id='logsink@@NOVERSION'/>
    <var-decl name='libmp_verbosity' type-id='type-id-6' mangled-name='libmp_verbosity' visibility='default' filepath='/build/libmultipath/debug.h' line='13' column='1' elf-symbol-id='libmp_verbosity@@NOVERSION'/>
    <function-decl name='dlog' mangled-name='dlog' filepath='/build/libmultipath/debug.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlog@@NOVERSION'>
      <parameter type-id='type-id-6' name='prio' filepath='/build/libmultipath/debug.c' line='23' column='1'/>
      <parameter type-id='type-id-4' name='fmt' filepath='/build/libmultipath/debug.c' line='23' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='defaults.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <var-decl name='default_partition_delim' type-id='type-id-146' visibility='default' filepath='/build/libmultipath/defaults.h' line='78' column='1'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uevent.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <class-decl name='uevent' size-in-bits='23168' is-struct='yes' visibility='default' filepath='/build/libmultipath/uevent.h' line='15' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='node' type-id='type-id-102' visibility='default' filepath='/build/libmultipath/uevent.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge_node' type-id='type-id-102' visibility='default' filepath='/build/libmultipath/uevent.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='udev' type-id='type-id-85' visibility='default' filepath='/build/libmultipath/uevent.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buffer' type-id='type-id-158' visibility='default' filepath='/build/libmultipath/uevent.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20800'>
        <var-decl name='devpath' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/uevent.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20864'>
        <var-decl name='action' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/uevent.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20928'>
        <var-decl name='kernel' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/uevent.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20992'>
        <var-decl name='wwid' type-id='type-id-4' visibility='default' filepath='/build/libmultipath/uevent.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21056'>
        <var-decl name='seqnum' type-id='type-id-27' visibility='default' filepath='/build/libmultipath/uevent.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21120'>
        <var-decl name='envp' type-id='type-id-159' visibility='default' filepath='/build/libmultipath/uevent.h' line='25' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='20480' id='type-id-158'>
      <subrange length='2560' type-id='type-id-27' id='type-id-160'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='2048' id='type-id-159'>
      <subrange length='32' type-id='type-id-27' id='type-id-161'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <function-decl name='uevent_is_mpath' mangled-name='uevent_is_mpath' filepath='/build/libmultipath/uevent.c' line='780' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uevent_is_mpath@@NOVERSION'>
      <parameter type-id='type-id-163' name='uev' filepath='/build/libmultipath/uevent.c' line='780' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uevent_get_dm_str' mangled-name='uevent_get_dm_str' filepath='/build/libmultipath/uevent.c' line='771' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uevent_get_dm_str@@NOVERSION'>
      <parameter type-id='type-id-163' name='uev' filepath='/build/libmultipath/uevent.c' line='771' column='1'/>
      <parameter type-id='type-id-12' name='attr' filepath='/build/libmultipath/uevent.c' line='771' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <class-decl name='udev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <function-decl name='uevent_listen' mangled-name='uevent_listen' filepath='/build/libmultipath/uevent.c' line='681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uevent_listen@@NOVERSION'>
      <parameter type-id='type-id-165' name='udev' filepath='/build/libmultipath/uevent.c' line='681' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <function-decl name='uevent_dispatch' mangled-name='uevent_dispatch' filepath='/build/libmultipath/uevent.c' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uevent_dispatch@@NOVERSION'>
      <parameter type-id='type-id-168' name='uev_trigger' filepath='/build/libmultipath/uevent.c' line='533' column='1'/>
      <parameter type-id='type-id-9' name='trigger_data' filepath='/build/libmultipath/uevent.c' line='534' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uevent_get_env_positive_int' mangled-name='uevent_get_env_positive_int' filepath='/build/libmultipath/uevent.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uevent_get_env_positive_int@@NOVERSION'>
      <parameter type-id='type-id-163' name='uev' filepath='/build/libmultipath/uevent.c' line='158' column='1'/>
      <parameter type-id='type-id-4' name='attr' filepath='/build/libmultipath/uevent.c' line='159' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__poll_alias' mangled-name='poll' filepath='/usr/include/x86_64-linux-gnu/bits/poll2.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_list_entry_get_value' mangled-name='udev_list_entry_get_value' filepath='/usr/include/libudev.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strrchr' mangled-name='strrchr' filepath='/usr/include/string.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_monitor_receive_device' mangled-name='udev_monitor_receive_device' filepath='/usr/include/libudev.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' mangled-name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='974' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_monitor_set_receive_buffer_size' mangled-name='udev_monitor_set_receive_buffer_size' filepath='/usr/include/libudev.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_monitor_get_fd' mangled-name='udev_monitor_get_fd' filepath='/usr/include/libudev.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fcntl' mangled-name='fcntl' filepath='/usr/include/fcntl.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_monitor_filter_add_match_subsystem_devtype' mangled-name='udev_monitor_filter_add_match_subsystem_devtype' filepath='/usr/include/libudev.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_monitor_enable_receiving' mangled-name='udev_monitor_enable_receiving' filepath='/usr/include/libudev.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_monitor_new_from_netlink' mangled-name='udev_monitor_new_from_netlink' filepath='/usr/include/libudev.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_ref' mangled-name='udev_ref' filepath='/usr/include/libudev.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' mangled-name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='986' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mlockall' mangled-name='mlockall' filepath='/usr/include/x86_64-linux-gnu/sys/mman.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_monitor_unref' mangled-name='udev_monitor_unref' filepath='/usr/include/libudev.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_unref' mangled-name='udev_unref' filepath='/usr/include/libudev.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='time-util.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='10' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-114' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-170' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-113' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='196' column='1' id='type-id-170'/>
    <qualified-type-def type-id='type-id-169' const='yes' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <function-decl name='timespeccmp' mangled-name='timespeccmp' filepath='/build/libmultipath/time-util.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='timespeccmp@@NOVERSION'>
      <parameter type-id='type-id-172' name='a' filepath='/build/libmultipath/time-util.c' line='53' column='1'/>
      <parameter type-id='type-id-172' name='b' filepath='/build/libmultipath/time-util.c' line='53' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-173'/>
    <function-decl name='timespecsub' mangled-name='timespecsub' filepath='/build/libmultipath/time-util.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='timespecsub@@NOVERSION'>
      <parameter type-id='type-id-172' name='a' filepath='/build/libmultipath/time-util.c' line='45' column='1'/>
      <parameter type-id='type-id-172' name='b' filepath='/build/libmultipath/time-util.c' line='45' column='1'/>
      <parameter type-id='type-id-173' name='res' filepath='/build/libmultipath/time-util.c' line='46' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='normalize_timespec' mangled-name='normalize_timespec' filepath='/build/libmultipath/time-util.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='normalize_timespec@@NOVERSION'>
      <parameter type-id='type-id-173' name='ts' filepath='/build/libmultipath/time-util.c' line='32' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-174'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-175' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-176' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-177' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='92' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-179' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-179' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-179' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-178'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-180' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='64' id='type-id-179'>
      <subrange length='2' type-id='type-id-27' id='type-id-154'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='384' id='type-id-176'>
      <subrange length='48' type-id='type-id-27' id='type-id-181'/>

    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-177'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-174' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <function-decl name='pthread_cond_init_mono' mangled-name='pthread_cond_init_mono' filepath='/build/libmultipath/time-util.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_cond_init_mono@@NOVERSION'>
      <parameter type-id='type-id-183' name='cond' filepath='/build/libmultipath/time-util.c' line='16' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_monotonic_time' mangled-name='get_monotonic_time' filepath='/build/libmultipath/time-util.c' line='6' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_monotonic_time@@NOVERSION'>
      <parameter type-id='type-id-173' name='res' filepath='/build/libmultipath/time-util.c' line='6' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_condattr_init' mangled-name='pthread_condattr_init' filepath='/usr/include/pthread.h' line='1020' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_condattr_setclock' mangled-name='pthread_condattr_setclock' filepath='/usr/include/pthread.h' line='1045' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_cond_init' mangled-name='pthread_cond_init' filepath='/usr/include/pthread.h' line='965' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_condattr_destroy' mangled-name='pthread_condattr_destroy' filepath='/usr/include/pthread.h' line='1024' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='clock_gettime' mangled-name='clock_gettime' filepath='/usr/include/time.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='switchgroup.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='select_path_group' mangled-name='select_path_group' filepath='/build/libmultipath/switchgroup.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='select_path_group@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/switchgroup.c' line='39' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uxsock.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='recv_packet' mangled-name='recv_packet' filepath='/build/libmultipath/uxsock.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='recv_packet@@NOVERSION'>
      <parameter type-id='type-id-6' name='fd' filepath='/build/libmultipath/uxsock.c' line='127' column='1'/>
      <parameter type-id='type-id-127' name='buf' filepath='/build/libmultipath/uxsock.c' line='127' column='1'/>
      <parameter type-id='type-id-23' name='timeout' filepath='/build/libmultipath/uxsock.c' line='127' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='send_packet' mangled-name='send_packet' filepath='/build/libmultipath/uxsock.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='send_packet@@NOVERSION'>
      <parameter type-id='type-id-6' name='fd' filepath='/build/libmultipath/uxsock.c' line='92' column='1'/>
      <parameter type-id='type-id-4' name='buf' filepath='/build/libmultipath/uxsock.c' line='92' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='ux_socket_listen' mangled-name='ux_socket_listen' filepath='/build/libmultipath/uxsock.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ux_socket_listen@@NOVERSION'>
      <parameter type-id='type-id-4' name='name' filepath='/build/libmultipath/uxsock.c' line='40' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='mpath_recv_reply_len' mangled-name='mpath_recv_reply_len' filepath='../libmpathcmd/mpath_cmd.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mpath_recv_reply_data' mangled-name='mpath_recv_reply_data' filepath='../libmpathcmd/mpath_cmd.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mpath_send_cmd' mangled-name='mpath_send_cmd' filepath='../libmpathcmd/mpath_cmd.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sd_listen_fds' mangled-name='sd_listen_fds' filepath='/usr/include/systemd/sd-daemon.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='socket' mangled-name='socket' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='bind' mangled-name='bind' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='listen' mangled-name='listen' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='print.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='print_all_paths' mangled-name='print_all_paths' filepath='/build/libmultipath/print.c' line='2043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_all_paths@@NOVERSION'>
      <parameter type-id='type-id-11' name='pathvec' filepath='/build/libmultipath/print.c' line='2043' column='1'/>
      <parameter type-id='type-id-6' name='banner' filepath='/build/libmultipath/print.c' line='2043' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <class-decl name='vectors' size-in-bits='512' is-struct='yes' visibility='default' filepath='/build/libmultipath/structs_vec.h' line='8' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pathvec' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/structs_vec.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mpvec' type-id='type-id-11' visibility='default' filepath='/build/libmultipath/structs_vec.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lock' type-id='type-id-185' visibility='default' filepath='/build/libmultipath/structs_vec.h' line='11' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mutex_lock' size-in-bits='384' is-struct='yes' visibility='default' filepath='/build/libmultipath/lock.h' line='8' column='1' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-186' visibility='default' filepath='/build/libmultipath/lock.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='wakeup' type-id='type-id-187' visibility='default' filepath='/build/libmultipath/lock.h' line='10' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-188'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-189' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-113' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-98' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-98' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-191' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='49' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-193' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-193' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-192' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1' id='type-id-191'/>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='320' id='type-id-190'>
      <subrange length='40' type-id='type-id-27' id='type-id-194'/>

    </array-type-def>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-188' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-186'/>
    <typedef-decl name='wakeup_fn' type-id='type-id-195' filepath='/build/libmultipath/lock.h' line='6' column='1' id='type-id-196'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-187'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-197'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <function-decl name='snprint_devices' mangled-name='snprint_devices' filepath='/build/libmultipath/print.c' line='1940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_devices@@NOVERSION'>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/print.c' line='1940' column='1'/>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='1940' column='1'/>
      <parameter type-id='type-id-198' name='vecs' filepath='/build/libmultipath/print.c' line='1941' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_status' mangled-name='snprint_status' filepath='/build/libmultipath/print.c' line='1908' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_status@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='1908' column='1'/>
      <parameter type-id='type-id-198' name='vecs' filepath='/build/libmultipath/print.c' line='1908' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_config' mangled-name='snprint_config' filepath='/build/libmultipath/print.c' line='1891' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_config@@NOVERSION'>
      <parameter type-id='type-id-81' name='conf' filepath='/build/libmultipath/print.c' line='1891' column='1'/>
      <parameter type-id='type-id-61' name='len' filepath='/build/libmultipath/print.c' line='1891' column='1'/>
      <parameter type-id='type-id-51' name='hwtable' filepath='/build/libmultipath/print.c' line='1892' column='1'/>
      <parameter type-id='type-id-51' name='mpvec' filepath='/build/libmultipath/print.c' line='1892' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='__snprint_config' mangled-name='__snprint_config' filepath='/build/libmultipath/print.c' line='1870' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__snprint_config@@NOVERSION'>
      <parameter type-id='type-id-81' name='conf' filepath='/build/libmultipath/print.c' line='1870' column='1'/>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='1870' column='1'/>
      <parameter type-id='type-id-51' name='hwtable' filepath='/build/libmultipath/print.c' line='1871' column='1'/>
      <parameter type-id='type-id-51' name='mpvec' filepath='/build/libmultipath/print.c' line='1871' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_blacklist_report' mangled-name='snprint_blacklist_report' filepath='/build/libmultipath/print.c' line='1691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_blacklist_report@@NOVERSION'>
      <parameter type-id='type-id-155' name='conf' filepath='/build/libmultipath/print.c' line='1691' column='1'/>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='1691' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_multipath_topology_json' mangled-name='snprint_multipath_topology_json' filepath='/build/libmultipath/print.c' line='1390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_multipath_topology_json@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='1390' column='1'/>
      <parameter type-id='type-id-198' name='vecs' filepath='/build/libmultipath/print.c' line='1391' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_multipath_map_json' mangled-name='snprint_multipath_map_json' filepath='/build/libmultipath/print.c' line='1371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_multipath_map_json@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='1371' column='1'/>
      <parameter type-id='type-id-64' name='mpp' filepath='/build/libmultipath/print.c' line='1371' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <typedef-decl name='fieldwidth_t' type-id='type-id-42' filepath='/build/libmultipath/generic.h' line='26' column='1' id='type-id-199'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <function-decl name='_snprint_multipath_topology' mangled-name='_snprint_multipath_topology' filepath='/build/libmultipath/print.c' line='1228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_snprint_multipath_topology@@NOVERSION'>
      <parameter type-id='type-id-53' name='gmp' filepath='/build/libmultipath/print.c' line='1228' column='1'/>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='1229' column='1'/>
      <parameter type-id='type-id-6' name='verbosity' filepath='/build/libmultipath/print.c' line='1229' column='1'/>
      <parameter type-id='type-id-201' name='p_width' filepath='/build/libmultipath/print.c' line='1230' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_print_multipath_topology' mangled-name='_print_multipath_topology' filepath='/build/libmultipath/print.c' line='1187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_print_multipath_topology@@NOVERSION'>
      <parameter type-id='type-id-53' name='gmp' filepath='/build/libmultipath/print.c' line='1187' column='1'/>
      <parameter type-id='type-id-6' name='verbosity' filepath='/build/libmultipath/print.c' line='1187' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_snprint_path' mangled-name='_snprint_path' filepath='/build/libmultipath/print.c' line='1133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_snprint_path@@NOVERSION'>
      <parameter type-id='type-id-119' name='gp' filepath='/build/libmultipath/print.c' line='1133' column='1'/>
      <parameter type-id='type-id-57' name='line' filepath='/build/libmultipath/print.c' line='1133' column='1'/>
      <parameter type-id='type-id-4' name='format' filepath='/build/libmultipath/print.c' line='1134' column='1'/>
      <parameter type-id='type-id-201' name='width' filepath='/build/libmultipath/print.c' line='1134' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_path_header' mangled-name='snprint_path_header' filepath='/build/libmultipath/print.c' line='1102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_path_header@@NOVERSION'>
      <parameter type-id='type-id-57' name='line' filepath='/build/libmultipath/print.c' line='1102' column='1'/>
      <parameter type-id='type-id-4' name='format' filepath='/build/libmultipath/print.c' line='1102' column='1'/>
      <parameter type-id='type-id-201' name='width' filepath='/build/libmultipath/print.c' line='1103' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_snprint_multipath' mangled-name='_snprint_multipath' filepath='/build/libmultipath/print.c' line='1072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_snprint_multipath@@NOVERSION'>
      <parameter type-id='type-id-53' name='gmp' filepath='/build/libmultipath/print.c' line='1072' column='1'/>
      <parameter type-id='type-id-57' name='line' filepath='/build/libmultipath/print.c' line='1073' column='1'/>
      <parameter type-id='type-id-4' name='format' filepath='/build/libmultipath/print.c' line='1073' column='1'/>
      <parameter type-id='type-id-201' name='width' filepath='/build/libmultipath/print.c' line='1074' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_multipath_header' mangled-name='snprint_multipath_header' filepath='/build/libmultipath/print.c' line='1041' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_multipath_header@@NOVERSION'>
      <parameter type-id='type-id-57' name='line' filepath='/build/libmultipath/print.c' line='1102' column='1'/>
      <parameter type-id='type-id-4' name='format' filepath='/build/libmultipath/print.c' line='1102' column='1'/>
      <parameter type-id='type-id-201' name='width' filepath='/build/libmultipath/print.c' line='1103' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-202'/>
    <function-decl name='get_multipath_layout' mangled-name='get_multipath_layout' filepath='/build/libmultipath/print.c' line='939' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_multipath_layout@@NOVERSION'>
      <parameter type-id='type-id-11' name='mpvec' filepath='/build/libmultipath/print.c' line='939' column='1'/>
      <parameter type-id='type-id-6' name='header' filepath='/build/libmultipath/print.c' line='939' column='1'/>
      <parameter type-id='type-id-202' name='width' filepath='/build/libmultipath/print.c' line='939' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_multipath_layout' mangled-name='alloc_multipath_layout' filepath='/build/libmultipath/print.c' line='934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_multipath_layout@@NOVERSION'>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='get_path_layout' mangled-name='get_path_layout' filepath='/build/libmultipath/print.c' line='882' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_path_layout@@NOVERSION'>
      <parameter type-id='type-id-11' name='mpvec' filepath='/build/libmultipath/print.c' line='939' column='1'/>
      <parameter type-id='type-id-6' name='header' filepath='/build/libmultipath/print.c' line='939' column='1'/>
      <parameter type-id='type-id-202' name='width' filepath='/build/libmultipath/print.c' line='939' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_path_layout' mangled-name='alloc_path_layout' filepath='/build/libmultipath/print.c' line='878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_path_layout@@NOVERSION'>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='snprint_wildcards' mangled-name='snprint_wildcards' filepath='/build/libmultipath/print.c' line='848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_wildcards@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='848' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_tgt_wwpn' mangled-name='snprint_tgt_wwpn' filepath='/build/libmultipath/print.c' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_tgt_wwpn@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='686' column='1'/>
      <parameter type-id='type-id-124' name='pp' filepath='/build/libmultipath/print.c' line='686' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_host_wwpn' mangled-name='snprint_host_wwpn' filepath='/build/libmultipath/print.c' line='680' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_host_wwpn@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='680' column='1'/>
      <parameter type-id='type-id-124' name='pp' filepath='/build/libmultipath/print.c' line='680' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_host_wwnn' mangled-name='snprint_host_wwnn' filepath='/build/libmultipath/print.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_host_wwnn@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='680' column='1'/>
      <parameter type-id='type-id-124' name='pp' filepath='/build/libmultipath/print.c' line='680' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_path_serial' mangled-name='snprint_path_serial' filepath='/build/libmultipath/print.c' line='630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_path_serial@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='630' column='1'/>
      <parameter type-id='type-id-124' name='pp' filepath='/build/libmultipath/print.c' line='630' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='snprint_tgt_wwnn' mangled-name='snprint_tgt_wwnn' filepath='/build/libmultipath/print.c' line='717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_tgt_wwnn@@NOVERSION'>
      <parameter type-id='type-id-57' name='buff' filepath='/build/libmultipath/print.c' line='717' column='1'/>
      <parameter type-id='type-id-124' name='pp' filepath='/build/libmultipath/print.c' line='717' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__printf_chk' mangled-name='__printf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='cleanup_ucharp' mangled-name='cleanup_ucharp' filepath='/build/libmultipath/util.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_path_by_dev' mangled-name='find_path_by_dev' filepath='/build/libmultipath/structs.h' line='538' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='is_uevent_busy' mangled-name='is_uevent_busy' filepath='/build/libmultipath/uevent.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_keyword' mangled-name='find_keyword' filepath='/build/libmultipath/parser.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='snprint_keyword' mangled-name='snprint_keyword' filepath='/build/libmultipath/parser.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_mp_by_wwid' mangled-name='find_mp_by_wwid' filepath='/build/libmultipath/structs.h' line='532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='count_active_paths' mangled-name='count_active_paths' filepath='/build/libmultipath/structs.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_get_host_adapter_name' mangled-name='sysfs_get_host_adapter_name' filepath='/build/libmultipath/discovery.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-195'>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='alias.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='check_alias_settings' mangled-name='check_alias_settings' filepath='/build/libmultipath/alias.c' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='check_alias_settings@@NOVERSION'>
      <parameter type-id='type-id-81' name='conf' filepath='/build/libmultipath/alias.c' line='698' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='valid_alias' mangled-name='valid_alias' filepath='/build/libmultipath/alias.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='valid_alias@@NOVERSION'>
      <parameter type-id='type-id-4' name='alias' filepath='/build/libmultipath/alias.c' line='54' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='vector_sort' mangled-name='vector_sort' filepath='/build/libmultipath/vector.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fdopen' mangled-name='fdopen' filepath='/usr/include/stdio.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='open_file' mangled-name='open_file' filepath='/build/libmultipath/file.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vector_insert_slot' mangled-name='vector_insert_slot' filepath='/build/libmultipath/vector.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek' filepath='/usr/include/unistd.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='ftruncate' mangled-name='ftruncate' filepath='/usr/include/unistd.h' line='1014' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strpbrk' mangled-name='strpbrk' filepath='/usr/include/string.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_get_uuid' mangled-name='dm_get_uuid' filepath='/build/libmultipath/devmapper.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_map_present' mangled-name='dm_map_present' filepath='/build/libmultipath/devmapper.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rewind' mangled-name='rewind' filepath='/usr/include/stdio.h' line='694' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__getdelim' mangled-name='__getdelim' filepath='/usr/include/stdio.h' line='603' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_mpe_wwid' mangled-name='get_mpe_wwid' filepath='/build/libmultipath/config.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='umask' mangled-name='umask' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mkstemp' mangled-name='mkstemp' filepath='/usr/include/stdlib.h' line='688' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='unlink' mangled-name='unlink' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rename' mangled-name='rename' filepath='/usr/include/stdio.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='log_pthread.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <function-decl name='log_thread_stop' mangled-name='log_thread_stop' filepath='/build/libmultipath/log_pthread.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='log_thread_stop@@NOVERSION'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_thread_reset' mangled-name='log_thread_reset' filepath='/build/libmultipath/log_pthread.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='log_thread_reset@@NOVERSION'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_thread_start' mangled-name='log_thread_start' filepath='/build/libmultipath/log_pthread.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='log_thread_start@@NOVERSION'>
      <parameter type-id='type-id-143' name='attr' filepath='/build/libmultipath/log_pthread.c' line='104' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_cancel' mangled-name='pthread_cancel' filepath='/usr/include/pthread.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_close' mangled-name='log_close' filepath='/build/libmultipath/log.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_join' mangled-name='pthread_join' filepath='/usr/include/pthread.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_reset' mangled-name='log_reset' filepath='/build/libmultipath/log.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_create' mangled-name='pthread_create' filepath='/usr/include/pthread.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_init' mangled-name='log_init' filepath='/build/libmultipath/log.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_dequeue' mangled-name='log_dequeue' filepath='/build/libmultipath/log.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_syslog' mangled-name='log_syslog' filepath='/build/libmultipath/log.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='log_enqueue' mangled-name='log_enqueue' filepath='/build/libmultipath/log.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__vsyslog_chk' mangled-name='__vsyslog_chk' filepath='/usr/include/x86_64-linux-gnu/bits/syslog.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='log.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <class-decl name='logarea' size-in-bits='384' is-struct='yes' visibility='default' filepath='/build/libmultipath/log.h' line='23' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='empty' type-id='type-id-6' visibility='default' filepath='/build/libmultipath/log.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-9' visibility='default' filepath='/build/libmultipath/log.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tail' type-id='type-id-9' visibility='default' filepath='/build/libmultipath/log.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='start' type-id='type-id-9' visibility='default' filepath='/build/libmultipath/log.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='end' type-id='type-id-9' visibility='default' filepath='/build/libmultipath/log.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buff' type-id='type-id-12' visibility='default' filepath='/build/libmultipath/log.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <var-decl name='la' type-id='type-id-204' visibility='default' filepath='/build/libmultipath/log.h' line='32' column='1'/>
    <function-decl name='__syslog_chk' mangled-name='__syslog_chk' filepath='/usr/include/x86_64-linux-gnu/bits/syslog.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__builtin___vsnprintf_chk' mangled-name='__vsnprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='closelog' mangled-name='closelog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='openlog' mangled-name='openlog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='configure.c' comp-dir-path='/build/libmultipath' language='LANG_C99'>
    <enum-decl name='mpath_cmds' filepath='/build/libmultipath/config.h' line='21' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-150'/>
      <enumerator name='CMD_NONE' value='0'/>
      <enumerator name='CMD_CREATE' value='1'/>
      <enumerator name='CMD_DRY_RUN' value='2'/>
      <enumerator name='CMD_LIST_SHORT' value='3'/>
      <enumerator name='CMD_LIST_LONG' value='4'/>
      <enumerator name='CMD_VALID_PATH' value='5'/>
      <enumerator name='CMD_REMOVE_WWID' value='6'/>
      <enumerator name='CMD_RESET_WWIDS' value='7'/>
      <enumerator name='CMD_ADD_WWID' value='8'/>
      <enumerator name='CMD_USABLE_PATHS' value='9'/>
      <enumerator name='CMD_DUMP_CONFIG' value='10'/>
      <enumerator name='CMD_FLUSH_ONE' value='11'/>
      <enumerator name='CMD_FLUSH_ALL' value='12'/>
    </enum-decl>
    <enum-decl name='devtypes' filepath='/build/libmultipath/config.h' line='13' column='1' id='type-id-206'>
      <underlying-type type-id='type-id-150'/>
      <enumerator name='DEV_NONE' value='0'/>
      <enumerator name='DEV_DEVT' value='1'/>
      <enumerator name='DEV_DEVNODE' value='2'/>
      <enumerator name='DEV_DEVMAP' value='3'/>
      <enumerator name='DEV_UEVENT' value='4'/>
    </enum-decl>
    <function-decl name='get_refwwid' mangled-name='get_refwwid' filepath='/build/libmultipath/configure.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_refwwid@@NOVERSION'>
      <parameter type-id='type-id-205' name='cmd' filepath='/build/libmultipath/configure.c' line='1411' column='1'/>
      <parameter type-id='type-id-4' name='dev' filepath='/build/libmultipath/configure.c' line='1411' column='1'/>
      <parameter type-id='type-id-206' name='dev_type' filepath='/build/libmultipath/configure.c' line='1411' column='1'/>
      <parameter type-id='type-id-11' name='pathvec' filepath='/build/libmultipath/configure.c' line='1412' column='1'/>
      <parameter type-id='type-id-127' name='wwid' filepath='/build/libmultipath/configure.c' line='1412' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='get_udev_device' mangled-name='get_udev_device' filepath='/build/libmultipath/configure.c' line='1269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_udev_device@@NOVERSION'>
      <parameter type-id='type-id-4' name='dev' filepath='/build/libmultipath/configure.c' line='1269' column='1'/>
      <parameter type-id='type-id-206' name='dev_type' filepath='/build/libmultipath/configure.c' line='1269' column='1'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-207'/>
    <function-decl name='coalesce_paths' mangled-name='coalesce_paths' filepath='/build/libmultipath/configure.c' line='1058' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='coalesce_paths@@NOVERSION'>
      <parameter type-id='type-id-207' name='vecs' filepath='/build/libmultipath/configure.c' line='1058' column='1'/>
      <parameter type-id='type-id-11' name='mpvec' filepath='/build/libmultipath/configure.c' line='1058' column='1'/>
      <parameter type-id='type-id-12' name='refwwid' filepath='/build/libmultipath/configure.c' line='1058' column='1'/>
      <parameter type-id='type-id-6' name='force_reload' filepath='/build/libmultipath/configure.c' line='1059' column='1'/>
      <parameter type-id='type-id-205' name='cmd' filepath='/build/libmultipath/configure.c' line='1059' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='check_daemon' mangled-name='check_daemon' filepath='/build/libmultipath/configure.c' line='1019' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='check_daemon@@NOVERSION'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='domap' mangled-name='domap' filepath='/build/libmultipath/configure.c' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='domap@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/configure.c' line='874' column='1'/>
      <parameter type-id='type-id-12' name='params' filepath='/build/libmultipath/configure.c' line='874' column='1'/>
      <parameter type-id='type-id-6' name='is_daemon' filepath='/build/libmultipath/configure.c' line='874' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='select_action' mangled-name='select_action' filepath='/build/libmultipath/configure.c' line='662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='select_action@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/configure.c' line='662' column='1'/>
      <parameter type-id='type-id-51' name='curmp' filepath='/build/libmultipath/configure.c' line='662' column='1'/>
      <parameter type-id='type-id-6' name='force_reload' filepath='/build/libmultipath/configure.c' line='663' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='trigger_path_udev_change' mangled-name='trigger_path_udev_change' filepath='/build/libmultipath/configure.c' line='514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='trigger_path_udev_change@@NOVERSION'>
      <parameter type-id='type-id-109' name='pp' filepath='/build/libmultipath/configure.c' line='514' column='1'/>
      <parameter type-id='type-id-1' name='is_mpath' filepath='/build/libmultipath/configure.c' line='514' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setup_map' mangled-name='setup_map' filepath='/build/libmultipath/configure.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setup_map@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/configure.c' line='260' column='1'/>
      <parameter type-id='type-id-127' name='params' filepath='/build/libmultipath/configure.c' line='260' column='1'/>
      <parameter type-id='type-id-207' name='vecs' filepath='/build/libmultipath/configure.c' line='260' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='trigger_paths_udev_change' mangled-name='trigger_paths_udev_change' filepath='/build/libmultipath/configure.c' line='557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='trigger_paths_udev_change@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/configure.c' line='557' column='1'/>
      <parameter type-id='type-id-1' name='is_mpath' filepath='/build/libmultipath/configure.c' line='557' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='reinstate_paths' mangled-name='reinstate_paths' filepath='/build/libmultipath/configure.c' line='807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='reinstate_paths@@NOVERSION'>
      <parameter type-id='type-id-29' name='mpp' filepath='/build/libmultipath/configure.c' line='807' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='basenamecpy' mangled-name='basenamecpy' filepath='/build/libmultipath/util.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='store_pathinfo' mangled-name='store_pathinfo' filepath='/build/libmultipath/discovery.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='get_user_friendly_wwid' mangled-name='get_user_friendly_wwid' filepath='/build/libmultipath/alias.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='parse_devt' mangled-name='parse_devt' filepath='/build/libmultipath/util.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_device_new_from_environment' mangled-name='udev_device_new_from_environment' filepath='/usr/include/libudev.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='filter_path' mangled-name='filter_path' filepath='/build/libmultipath/blacklist.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='orphan_path' mangled-name='orphan_path' filepath='/build/libmultipath/structs_vec.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='add_map_with_path' mangled-name='add_map_with_path' filepath='/build/libmultipath/structs_vec.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='verify_paths' mangled-name='verify_paths' filepath='/build/libmultipath/structs_vec.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='put_multipath_config' mangled-name='put_multipath_config' filepath='/build/libmultipath/config.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='remove_map' mangled-name='remove_map' filepath='/build/libmultipath/structs_vec.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_print_multipath_topology' mangled-name='_print_multipath_topology' filepath='/build/libmultipath/print.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_queue_if_no_path' mangled-name='dm_queue_if_no_path' filepath='/build/libmultipath/devmapper.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='should_multipath' mangled-name='should_multipath' filepath='/build/libmultipath/wwids.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='cleanup_charp' mangled-name='cleanup_charp' filepath='/build/libmultipath/util.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mpath_connect' mangled-name='mpath_connect' filepath='../libmpathcmd/mpath_cmd.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='send_packet' mangled-name='send_packet' filepath='/build/libmultipath/uxsock.h' line='3' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mpath_disconnect' mangled-name='mpath_disconnect' filepath='../libmpathcmd/mpath_cmd.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='recv_packet' mangled-name='recv_packet' filepath='/build/libmultipath/uxsock.h' line='4' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_rename' mangled-name='dm_rename' filepath='/build/libmultipath/devmapper.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pathcount' mangled-name='pathcount' filepath='/build/libmultipath/structs.h' line='541' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_addmap_reload' mangled-name='dm_addmap_reload' filepath='/build/libmultipath/devmapper.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_switchgroup' mangled-name='dm_switchgroup' filepath='/build/libmultipath/devmapper.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_setgeometry' mangled-name='dm_setgeometry' filepath='/build/libmultipath/devmapper.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_addmap_create' mangled-name='dm_addmap_create' filepath='/build/libmultipath/devmapper.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='remember_wwid' mangled-name='remember_wwid' filepath='/build/libmultipath/wwids.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pathcmp' mangled-name='pathcmp' filepath='/build/libmultipath/structs.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='find_mp_by_alias' mangled-name='find_mp_by_alias' filepath='/build/libmultipath/structs.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dm_get_info' mangled-name='dm_get_info' filepath='/build/libmultipath/devmapper.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='udev_enumerate_add_match_parent' mangled-name='udev_enumerate_add_match_parent' filepath='/usr/include/libudev.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_pgfailback' mangled-name='select_pgfailback' filepath='/build/libmultipath/propsel.h' line='2' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_pgpolicy' mangled-name='select_pgpolicy' filepath='/build/libmultipath/propsel.h' line='3' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_selector' mangled-name='select_selector' filepath='/build/libmultipath/propsel.h' line='4' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_no_path_retry' mangled-name='select_no_path_retry' filepath='/build/libmultipath/propsel.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_retain_hwhandler' mangled-name='select_retain_hwhandler' filepath='/build/libmultipath/propsel.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_skip_kpartx' mangled-name='select_skip_kpartx' filepath='/build/libmultipath/propsel.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_features' mangled-name='select_features' filepath='/build/libmultipath/propsel.h' line='6' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_hwhandler' mangled-name='select_hwhandler' filepath='/build/libmultipath/propsel.h' line='7' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_rr_weight' mangled-name='select_rr_weight' filepath='/build/libmultipath/propsel.h' line='1' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_minio' mangled-name='select_minio' filepath='/build/libmultipath/propsel.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_mode' mangled-name='select_mode' filepath='/build/libmultipath/propsel.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_uid' mangled-name='select_uid' filepath='/build/libmultipath/propsel.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_gid' mangled-name='select_gid' filepath='/build/libmultipath/propsel.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_reservation_key' mangled-name='select_reservation_key' filepath='/build/libmultipath/propsel.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_deferred_remove' mangled-name='select_deferred_remove' filepath='/build/libmultipath/propsel.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_marginal_path_err_sample_time' mangled-name='select_marginal_path_err_sample_time' filepath='/build/libmultipath/propsel.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_marginal_path_err_rate_threshold' mangled-name='select_marginal_path_err_rate_threshold' filepath='/build/libmultipath/propsel.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_marginal_path_err_recheck_gap_time' mangled-name='select_marginal_path_err_recheck_gap_time' filepath='/build/libmultipath/propsel.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_marginal_path_double_failed_time' mangled-name='select_marginal_path_double_failed_time' filepath='/build/libmultipath/propsel.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_san_path_err_threshold' mangled-name='select_san_path_err_threshold' filepath='/build/libmultipath/propsel.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_san_path_err_forget_rate' mangled-name='select_san_path_err_forget_rate' filepath='/build/libmultipath/propsel.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_san_path_err_recovery_time' mangled-name='select_san_path_err_recovery_time' filepath='/build/libmultipath/propsel.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_delay_checks' mangled-name='select_delay_checks' filepath='/build/libmultipath/propsel.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_max_sectors_kb' mangled-name='select_max_sectors_kb' filepath='/build/libmultipath/propsel.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_ghost_delay' mangled-name='select_ghost_delay' filepath='/build/libmultipath/propsel.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_flush_on_last_del' mangled-name='select_flush_on_last_del' filepath='/build/libmultipath/propsel.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sysfs_set_scsi_tmo' mangled-name='sysfs_set_scsi_tmo' filepath='/build/libmultipath/discovery.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='start_io_err_stat_thread' mangled-name='start_io_err_stat_thread' filepath='/build/libmultipath/io_err_stat.h' line='10' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='group_paths' mangled-name='group_paths' filepath='/build/libmultipath/pgpolicies.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select_path_group' mangled-name='select_path_group' filepath='/build/libmultipath/switchgroup.h' line='2' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='assemble_map' mangled-name='assemble_map' filepath='/build/libmultipath/dmparser.h' line='1' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='extract_hwe_from_path' mangled-name='extract_hwe_from_path' filepath='/build/libmultipath/structs_vec.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='free_adaptergroup' mangled-name='free_adaptergroup' filepath='/build/libmultipath/structs.h' line='522' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='alloc_adaptergroup' mangled-name='alloc_adaptergroup' filepath='/build/libmultipath/structs.h' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='store_adaptergroup' mangled-name='store_adaptergroup' filepath='/build/libmultipath/structs.h' line='525' column='1' visibility='default' binding='global' size-in-bits='64'>
