<abi-corpus path='libmpathutil-nv.so' architecture='elf-amd-x86_64' soname='libmpathutil-nv.so'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libmpathcmd.so.0'/>
    <dependency name='libsystemd.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='__append_strbuf_str' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__get_strbuf_buf' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_install_keyword' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_log_bitfield_overflow' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='alloc_bitfield' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='alloc_strvec' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='put_multipath_config' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='recv_packet' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='reset_strbuf' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='safe_write' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='send_packet' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='set_max_fds' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='set_value' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='setup_thread_attr' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='should_exit' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='snprint_keyword' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='steal_strbuf_str' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strchop' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strlcat' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strlcpy' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='systemd_service_enabled' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='timespeccmp' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='timespecsub' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='truncate_strbuf' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ux_socket_listen' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='validate_config_strvec' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_alloc' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_alloc_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_del_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_find_or_add_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_free' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_insert_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_move_up' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_reset' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_set_slot' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vector_sort' version='NOVERSION' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='libmp_verbosity' size='4' version='NOVERSION' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='logsink' size='4' version='NOVERSION' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='parser.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='config' size-in-bits='4096' is-struct='yes' visibility='default' filepath='../libmultipath/config.h' line='139' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rcu' type-id='type-id-3' visibility='default' filepath='../libmultipath/config.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='verbosity' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pgpolicy_flag' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pgpolicy' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='minio' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='minio_rq' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='checkint' type-id='type-id-4' visibility='default' filepath='../libmultipath/config.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max_checkint' type-id='type-id-4' visibility='default' filepath='../libmultipath/config.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='use_watchdog' type-id='type-id-5' visibility='default' filepath='../libmultipath/config.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pgfailback' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='rr_weight' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='no_path_retry' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='user_friendly_names' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bindings_read_only' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='max_fds' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='force_reload' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='queue_without_daemon' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='checker_timeout' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='flush_on_last_del' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='attribute_flags' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='fast_io_fail' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='dev_loss' type-id='type-id-4' visibility='default' filepath='../libmultipath/config.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='eh_deadline' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='log_checker_err' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='allow_queueing' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='allow_usb_devices' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='find_multipaths' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='uid' type-id='type-id-6' visibility='default' filepath='../libmultipath/config.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='gid' type-id='type-id-7' visibility='default' filepath='../libmultipath/config.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='mode' type-id='type-id-8' visibility='default' filepath='../libmultipath/config.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='reassign_maps' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='retain_hwhandler' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='detect_prio' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='detect_checker' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='force_sync' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='deferred_remove' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='processed_main_config' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='delay_watch_checks' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='delay_wait_checks' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='san_path_err_threshold' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='san_path_err_forget_rate' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='san_path_err_recovery_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='marginal_path_err_sample_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='marginal_path_err_rate_threshold' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='marginal_path_err_recheck_gap_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='marginal_path_double_failed_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='uxsock_timeout' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='strict_timing' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='retrigger_tries' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='retrigger_delay' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='uev_wait_timeout' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='skip_kpartx' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='remove_retries' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='max_sectors_kb' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='ghost_delay' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='find_multipaths_timeout' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='marginal_pathgroups' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='skip_delegate' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='sequence_nr' type-id='type-id-4' visibility='default' filepath='../libmultipath/config.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='recheck_wwid' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='selector' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='uid_attrs' type-id='type-id-10' visibility='default' filepath='../libmultipath/config.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='uid_attribute' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='features' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='hwhandler' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='bindings_file' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='wwids_file' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='prkeys_file' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='prio_name' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='prio_args' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='checker_name' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='alias_prefix' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='partition_delim' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='prkey_source' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='all_tg_pt' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='reservation_key' type-id='type-id-11' visibility='default' filepath='../libmultipath/config.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='sa_flags' type-id='type-id-12' visibility='default' filepath='../libmultipath/config.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='keywords' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='mptable' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='hwtable' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='overrides' type-id='type-id-14' visibility='default' filepath='../libmultipath/config.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='blist_devnode' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='blist_wwid' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='blist_device' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='blist_property' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='blist_protocol' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='elist_devnode' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='elist_wwid' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='elist_device' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='elist_property' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='elist_protocol' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='enable_foreign' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='234' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rcu_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/call-rcu.h' line='57' column='1' id='type-id-3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/call-rcu.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='func' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/call-rcu.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cds_wfcq_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/wfcqueue.h' line='59' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/urcu/wfcqueue.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-17'/>
    <type-decl name='void' id='type-id-18'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-16'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-4'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-5'/>
    <typedef-decl name='__uid_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='146' column='1' id='type-id-21'/>
    <typedef-decl name='uid_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-6'/>
    <typedef-decl name='__gid_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='147' column='1' id='type-id-22'/>
    <typedef-decl name='gid_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='64' column='1' id='type-id-7'/>
    <typedef-decl name='__mode_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-23'/>
    <typedef-decl name='mode_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='69' column='1' id='type-id-8'/>
    <type-decl name='char' size-in-bits='8' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-9'/>
    <class-decl name='_vector' size-in-bits='128' is-struct='yes' visibility='default' filepath='/build/libmpathutil/vector.h' line='29' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocated' type-id='type-id-1' visibility='default' filepath='/build/libmpathutil/vector.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='slot' type-id='type-id-25' visibility='default' filepath='/build/libmpathutil/vector.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-25'/>
    <class-decl name='be64' size-in-bits='64' is-struct='yes' visibility='default' filepath='../libmultipath/byteorder.h' line='36' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_v' type-id='type-id-27' visibility='default' filepath='../libmultipath/byteorder.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-28'/>
    <typedef-decl name='__uint64_t' type-id='type-id-28' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-29'/>
    <typedef-decl name='uint64_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-27'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-30'/>
    <typedef-decl name='__uint8_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-31'/>
    <typedef-decl name='uint8_t' type-id='type-id-31' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-12'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-32'/>
    <typedef-decl name='vector' type-id='type-id-32' filepath='/build/libmpathutil/vector.h' line='33' column='1' id='type-id-13'/>
    <class-decl name='hwentry' size-in-bits='1792' is-struct='yes' visibility='default' filepath='../libmultipath/config.h' line='52' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vendor' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='product' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='revision' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uid_attribute' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='features' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='hwhandler' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='selector' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='checker_name' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prio_name' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='prio_args' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='alias_prefix' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pgpolicy' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='pgfailback' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='rr_weight' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='no_path_retry' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='minio' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='minio_rq' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='flush_on_last_del' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='fast_io_fail' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dev_loss' type-id='type-id-4' visibility='default' filepath='../libmultipath/config.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='eh_deadline' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user_friendly_names' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='retain_hwhandler' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='detect_prio' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='detect_checker' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='deferred_remove' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='delay_watch_checks' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='delay_wait_checks' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='san_path_err_threshold' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='san_path_err_forget_rate' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='san_path_err_recovery_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='marginal_path_err_sample_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='marginal_path_err_rate_threshold' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='marginal_path_err_recheck_gap_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='marginal_path_double_failed_time' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='skip_kpartx' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='max_sectors_kb' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='ghost_delay' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='all_tg_pt' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='vpd_vendor_id' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='recheck_wwid' type-id='type-id-1' visibility='default' filepath='../libmultipath/config.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='bl_product' type-id='type-id-9' visibility='default' filepath='../libmultipath/config.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='pctable' type-id='type-id-13' visibility='default' filepath='../libmultipath/config.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-34'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-35'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-36'/>
    <function-decl name='process_file' mangled-name='process_file' filepath='/build/libmpathutil/parser.c' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='process_file@@NOVERSION'>
      <parameter type-id='type-id-34' name='conf' filepath='/build/libmpathutil/parser.c' line='594' column='1'/>
      <parameter type-id='type-id-36' name='file' filepath='/build/libmpathutil/parser.c' line='594' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='validate_config_strvec' mangled-name='validate_config_strvec' filepath='/build/libmpathutil/parser.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='validate_config_strvec@@NOVERSION'>
      <parameter type-id='type-id-13' name='strvec' filepath='/build/libmpathutil/parser.c' line='416' column='1'/>
      <parameter type-id='type-id-36' name='file' filepath='/build/libmpathutil/parser.c' line='416' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='set_value' mangled-name='set_value' filepath='/build/libmpathutil/parser.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_value@@NOVERSION'>
      <parameter type-id='type-id-13' name='strvec' filepath='/build/libmpathutil/parser.c' line='333' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='is_quote' mangled-name='is_quote' filepath='/build/libmpathutil/parser.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_quote@@NOVERSION'>
      <parameter type-id='type-id-36' name='token' filepath='/build/libmpathutil/parser.c' line='200' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <class-decl name='strbuf' size-in-bits='192' is-struct='yes' visibility='default' filepath='/build/libmpathutil/strbuf.h' line='10' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-9' visibility='default' filepath='/build/libmpathutil/strbuf.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-38' visibility='default' filepath='/build/libmpathutil/strbuf.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offs' type-id='type-id-38' visibility='default' filepath='/build/libmpathutil/strbuf.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='type-id-28' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-38'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-39'/>
    <class-decl name='keyword' size-in-bits='320' is-struct='yes' visibility='default' filepath='/build/libmpathutil/parser.h' line='48' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='string' type-id='type-id-9' visibility='default' filepath='/build/libmpathutil/parser.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='handler' type-id='type-id-41' visibility='default' filepath='/build/libmpathutil/parser.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print' type-id='type-id-42' visibility='default' filepath='/build/libmpathutil/parser.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sub' type-id='type-id-13' visibility='default' filepath='/build/libmpathutil/parser.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unique' type-id='type-id-1' visibility='default' filepath='/build/libmpathutil/parser.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='handler_fn' type-id='type-id-43' filepath='/build/libmpathutil/parser.h' line='46' column='1' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-41'/>
    <typedef-decl name='print_fn' type-id='type-id-45' filepath='/build/libmpathutil/parser.h' line='45' column='1' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-47'/>
    <function-decl name='snprint_keyword' mangled-name='snprint_keyword' filepath='/build/libmpathutil/parser.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprint_keyword@@NOVERSION'>
      <parameter type-id='type-id-39' name='buff' filepath='/build/libmpathutil/parser.c' line='152' column='1'/>
      <parameter type-id='type-id-36' name='fmt' filepath='/build/libmpathutil/parser.c' line='152' column='1'/>
      <parameter type-id='type-id-47' name='kw' filepath='/build/libmpathutil/parser.c' line='152' column='1'/>
      <parameter type-id='type-id-26' name='data' filepath='/build/libmpathutil/parser.c' line='153' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='free_keywords' mangled-name='free_keywords' filepath='/build/libmpathutil/parser.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_keywords@@NOVERSION'>
      <parameter type-id='type-id-13' name='keywords' filepath='/build/libmpathutil/parser.c' line='105' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='_install_keyword' mangled-name='_install_keyword' filepath='/build/libmpathutil/parser.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_install_keyword@@NOVERSION'>
      <parameter type-id='type-id-13' name='keywords' filepath='/build/libmpathutil/parser.c' line='73' column='1'/>
      <parameter type-id='type-id-9' name='string' filepath='/build/libmpathutil/parser.c' line='73' column='1'/>
      <parameter type-id='type-id-41' name='handler' filepath='/build/libmpathutil/parser.c' line='74' column='1'/>
      <parameter type-id='type-id-42' name='print' filepath='/build/libmpathutil/parser.c' line='75' column='1'/>
      <parameter type-id='type-id-1' name='unique' filepath='/build/libmpathutil/parser.c' line='76' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='install_sublevel_end' mangled-name='install_sublevel_end' filepath='/build/libmpathutil/parser.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='install_sublevel_end@@NOVERSION'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='install_sublevel' mangled-name='install_sublevel' filepath='/build/libmpathutil/parser.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='install_sublevel@@NOVERSION'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='keyword_alloc' mangled-name='keyword_alloc' filepath='/build/libmpathutil/parser.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='keyword_alloc@@NOVERSION'>
      <parameter type-id='type-id-13' name='keywords' filepath='/build/libmpathutil/parser.c' line='34' column='1'/>
      <parameter type-id='type-id-9' name='string' filepath='/build/libmpathutil/parser.c' line='34' column='1'/>
      <parameter type-id='type-id-41' name='handler' filepath='/build/libmpathutil/parser.c' line='35' column='1'/>
      <parameter type-id='type-id-42' name='print' filepath='/build/libmpathutil/parser.c' line='36' column='1'/>
      <parameter type-id='type-id-1' name='unique' filepath='/build/libmpathutil/parser.c' line='37' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='alloc_strvec' mangled-name='alloc_strvec' filepath='/build/libmpathutil/parser.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_strvec@@NOVERSION'>
      <parameter type-id='type-id-9' name='string' filepath='/build/libmpathutil/parser.c' line='208' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='dlog' mangled-name='dlog' filepath='/build/libmpathutil/debug.h' line='3' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strerror' mangled-name='strerror' filepath='/usr/include/string.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen' filepath='/usr/include/stdio.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__fgets_alias' mangled-name='fgets' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtok_r' mangled-name='strtok_r' filepath='/usr/include/string.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_alloc' mangled-name='vector_alloc' filepath='/build/libmpathutil/vector.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='free_strvec' mangled-name='free_strvec' filepath='/build/libmpathutil/vector.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_free' mangled-name='vector_free' filepath='/build/libmpathutil/vector.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' filepath='/usr/include/string.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__sigsetjmp' mangled-name='__sigsetjmp' filepath='/usr/include/pthread.h' line='719' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__pthread_register_cancel' mangled-name='__pthread_register_cancel' filepath='/usr/include/pthread.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__pthread_unregister_cancel' mangled-name='__pthread_unregister_cancel' filepath='/usr/include/pthread.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__pthread_unwind_next' mangled-name='__pthread_unwind_next' filepath='/usr/include/pthread.h' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__append_strbuf_str' mangled-name='__append_strbuf_str' filepath='/build/libmpathutil/strbuf.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='reset_strbuf' mangled-name='reset_strbuf' filepath='/build/libmpathutil/strbuf.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='append_strbuf_str' mangled-name='append_strbuf_str' filepath='/build/libmpathutil/strbuf.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='get_multipath_config' mangled-name='get_multipath_config' filepath='./globals.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='get_strbuf_len' mangled-name='get_strbuf_len' filepath='/build/libmpathutil/strbuf.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='get_strbuf_str' mangled-name='get_strbuf_str' filepath='/build/libmpathutil/strbuf.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_alloc_slot' mangled-name='vector_alloc_slot' filepath='/build/libmpathutil/vector.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_set_slot' mangled-name='vector_set_slot' filepath='/build/libmpathutil/vector.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strstr' mangled-name='strstr' filepath='/usr/include/string.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-45'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-43'>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-20'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-18'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='vector.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <function-decl name='vector_sort' mangled-name='vector_sort' filepath='/build/libmpathutil/vector.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_sort@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='213' column='1'/>
      <parameter type-id='type-id-49' name='compar' filepath='/build/libmpathutil/vector.c' line='213' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_find_or_add_slot' mangled-name='vector_find_or_add_slot' filepath='/build/libmpathutil/vector.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_find_or_add_slot@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='201' column='1'/>
      <parameter type-id='type-id-26' name='value' filepath='/build/libmpathutil/vector.c' line='201' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='vector_set_slot' mangled-name='vector_set_slot' filepath='/build/libmpathutil/vector.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_set_slot@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='190' column='1'/>
      <parameter type-id='type-id-26' name='value' filepath='/build/libmpathutil/vector.c' line='190' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='free_strvec' mangled-name='free_strvec' filepath='/build/libmpathutil/vector.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_strvec@@NOVERSION'>
      <parameter type-id='type-id-13' name='strvec' filepath='/build/libmpathutil/vector.c' line='173' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_free' mangled-name='vector_free' filepath='/build/libmpathutil/vector.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_free@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='165' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_reset' mangled-name='vector_reset' filepath='/build/libmpathutil/vector.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_reset@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='150' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='vector_del_slot' mangled-name='vector_del_slot' filepath='/build/libmpathutil/vector.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_del_slot@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='109' column='1'/>
      <parameter type-id='type-id-1' name='slot' filepath='/build/libmpathutil/vector.c' line='109' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='vector_insert_slot' mangled-name='vector_insert_slot' filepath='/build/libmpathutil/vector.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_insert_slot@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='78' column='1'/>
      <parameter type-id='type-id-1' name='slot' filepath='/build/libmpathutil/vector.c' line='78' column='1'/>
      <parameter type-id='type-id-26' name='value' filepath='/build/libmpathutil/vector.c' line='78' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='vector_move_up' mangled-name='vector_move_up' filepath='/build/libmpathutil/vector.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_move_up@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='62' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/build/libmpathutil/vector.c' line='62' column='1'/>
      <parameter type-id='type-id-1' name='dest' filepath='/build/libmpathutil/vector.c' line='62' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='vector_alloc' mangled-name='vector_alloc' filepath='/build/libmpathutil/vector.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_alloc@@NOVERSION'>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='vector_alloc_slot' mangled-name='vector_alloc_slot' filepath='/build/libmpathutil/vector.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='vector_alloc_slot@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='39' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='find_slot' mangled-name='find_slot' filepath='/build/libmpathutil/vector.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_slot@@NOVERSION'>
      <parameter type-id='type-id-13' name='v' filepath='/build/libmpathutil/vector.c' line='94' column='1'/>
      <parameter type-id='type-id-26' name='addr' filepath='/build/libmpathutil/vector.c' line='94' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='msort' mangled-name='msort' filepath='/build/libmpathutil/msort.h' line='4' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='realloc' mangled-name='realloc' filepath='/usr/include/stdlib.h' line='550' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-48'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='util.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <function-decl name='cleanup_ucharp' mangled-name='cleanup_ucharp' filepath='/build/libmpathutil/util.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_ucharp@@NOVERSION'>
      <parameter type-id='type-id-51' name='p' filepath='/build/libmpathutil/util.c' line='433' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-52'/>
    <function-decl name='cleanup_charp' mangled-name='cleanup_charp' filepath='/build/libmpathutil/util.c' line='428' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_charp@@NOVERSION'>
      <parameter type-id='type-id-52' name='p' filepath='/build/libmpathutil/util.c' line='428' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='should_exit' mangled-name='should_exit' filepath='/build/libmpathutil/util.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='should_exit@@NOVERSION'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_log_bitfield_overflow' mangled-name='_log_bitfield_overflow' filepath='/build/libmpathutil/util.c' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_log_bitfield_overflow@@NOVERSION'>
      <parameter type-id='type-id-36' name='f' filepath='/build/libmpathutil/util.c' line='418' column='1'/>
      <parameter type-id='type-id-4' name='bit' filepath='/build/libmpathutil/util.c' line='418' column='1'/>
      <parameter type-id='type-id-4' name='len' filepath='/build/libmpathutil/util.c' line='418' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <class-decl name='bitfield' size-in-bits='64' is-struct='yes' visibility='default' filepath='/build/libmpathutil/util.h' line='79' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-4' visibility='default' filepath='/build/libmpathutil/util.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits' type-id='type-id-54' visibility='default' filepath='/build/libmpathutil/util.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-55'/>
    <typedef-decl name='bitfield_t' type-id='type-id-55' filepath='/build/libmpathutil/util.h' line='71' column='1' id='type-id-56'/>

    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='infinite' id='type-id-54'>
      <subrange length='infinite' type-id='type-id-28' id='type-id-57'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-58'/>
    <function-decl name='alloc_bitfield' mangled-name='alloc_bitfield' filepath='/build/libmpathutil/util.c' line='401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alloc_bitfield@@NOVERSION'>
      <parameter type-id='type-id-4' name='maxbit' filepath='/build/libmpathutil/util.c' line='401' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='cleanup_fclose' mangled-name='cleanup_fclose' filepath='/build/libmpathutil/util.c' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_fclose@@NOVERSION'>
      <parameter type-id='type-id-26' name='p' filepath='/build/libmpathutil/util.c' line='395' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='cleanup_vector_free' mangled-name='cleanup_vector_free' filepath='/build/libmpathutil/util.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_vector_free@@NOVERSION'>
      <parameter type-id='type-id-26' name='p' filepath='/build/libmpathutil/util.c' line='395' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='cleanup_mutex' mangled-name='cleanup_mutex' filepath='/build/libmpathutil/util.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_mutex@@NOVERSION'>
      <parameter type-id='type-id-26' name='p' filepath='/build/libmpathutil/util.c' line='395' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='cleanup_fd_ptr' mangled-name='cleanup_fd_ptr' filepath='/build/libmpathutil/util.c' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_fd_ptr@@NOVERSION'>
      <parameter type-id='type-id-26' name='arg' filepath='/build/libmpathutil/util.c' line='374' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='cleanup_free_ptr' mangled-name='cleanup_free_ptr' filepath='/build/libmpathutil/util.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='cleanup_free_ptr@@NOVERSION'>
      <parameter type-id='type-id-26' name='arg' filepath='/build/libmpathutil/util.c' line='374' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <class-decl name='scandir_result' size-in-bits='128' is-struct='yes' visibility='default' filepath='/build/libmpathutil/util.h' line='54' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='di' type-id='type-id-60' visibility='default' filepath='/build/libmpathutil/util.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n' type-id='type-id-1' visibility='default' filepath='/build/libmpathutil/util.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='22' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-63' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-30' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ino_t' type-id='type-id-28' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='148' column='1' id='type-id-62'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-66'/>
    <typedef-decl name='__off_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-63'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-64'/>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='2048' id='type-id-65'>
      <subrange length='256' type-id='type-id-28' id='type-id-67'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-69'/>
    <function-decl name='free_scandir_result' mangled-name='free_scandir_result' filepath='/build/libmpathutil/util.c' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_scandir_result@@NOVERSION'>
      <parameter type-id='type-id-69' name='res' filepath='/build/libmpathutil/util.c' line='355' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <typedef-decl name='__rlim_t' type-id='type-id-28' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='157' column='1' id='type-id-70'/>
    <typedef-decl name='rlim_t' type-id='type-id-70' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='131' column='1' id='type-id-71'/>
    <function-decl name='set_max_fds' mangled-name='set_max_fds' filepath='/build/libmpathutil/util.c' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_max_fds@@NOVERSION'>
      <parameter type-id='type-id-71' name='max_fds' filepath='/build/libmpathutil/util.c' line='324' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='safe_write' mangled-name='safe_write' filepath='/build/libmpathutil/util.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='safe_write@@NOVERSION'>
      <parameter type-id='type-id-1' name='fd' filepath='/build/libmpathutil/util.c' line='309' column='1'/>
      <parameter type-id='type-id-26' name='buf' filepath='/build/libmpathutil/util.c' line='309' column='1'/>
      <parameter type-id='type-id-38' name='count' filepath='/build/libmpathutil/util.c' line='309' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='get_linux_version_code' mangled-name='get_linux_version_code' filepath='/build/libmpathutil/util.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_linux_version_code@@NOVERSION'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='systemd_service_enabled' mangled-name='systemd_service_enabled' filepath='/build/libmpathutil/util.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='systemd_service_enabled@@NOVERSION'>
      <parameter type-id='type-id-36' name='dev' filepath='/build/libmpathutil/util.c' line='260' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <union-decl name='pthread_attr_t' size-in-bits='448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='56' column='1' id='type-id-72'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-73' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='58' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='59' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='448' id='type-id-73'>
      <subrange length='56' type-id='type-id-28' id='type-id-74'/>

    </array-type-def>
    <typedef-decl name='pthread_attr_t' type-id='type-id-72' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='62' column='1' id='type-id-75'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <function-decl name='setup_thread_attr' mangled-name='setup_thread_attr' filepath='/build/libmpathutil/util.c' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setup_thread_attr@@NOVERSION'>
      <parameter type-id='type-id-76' name='attr' filepath='/build/libmpathutil/util.c' line='199' column='1'/>
      <parameter type-id='type-id-38' name='stacksize' filepath='/build/libmpathutil/util.c' line='199' column='1'/>
      <parameter type-id='type-id-1' name='detached' filepath='/build/libmpathutil/util.c' line='199' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <typedef-decl name='__dev_t' type-id='type-id-28' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='145' column='1' id='type-id-77'/>
    <typedef-decl name='dev_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='40' column='1' id='type-id-78'/>
    <function-decl name='parse_devt' mangled-name='parse_devt' filepath='/build/libmpathutil/util.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='parse_devt@@NOVERSION'>
      <parameter type-id='type-id-36' name='dev_t' filepath='/build/libmpathutil/util.c' line='188' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='convert_dev' mangled-name='convert_dev' filepath='/build/libmpathutil/util.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='convert_dev@@NOVERSION'>
      <parameter type-id='type-id-9' name='name' filepath='/build/libmpathutil/util.c' line='168' column='1'/>
      <parameter type-id='type-id-1' name='is_path_device' filepath='/build/libmpathutil/util.c' line='168' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-79'/>
    <qualified-type-def type-id='type-id-36' restrict='yes' id='type-id-80'/>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='/build/libmpathutil/util.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat@@NOVERSION'>
      <parameter type-id='type-id-79' name='dst' filepath='/build/libmpathutil/util.c' line='144' column='1'/>
      <parameter type-id='type-id-80' name='src' filepath='/build/libmpathutil/util.c' line='144' column='1'/>
      <parameter type-id='type-id-38' name='size' filepath='/build/libmpathutil/util.c' line='144' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='/build/libmpathutil/util.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy@@NOVERSION'>
      <parameter type-id='type-id-79' name='dst' filepath='/build/libmpathutil/util.c' line='127' column='1'/>
      <parameter type-id='type-id-80' name='src' filepath='/build/libmpathutil/util.c' line='127' column='1'/>
      <parameter type-id='type-id-38' name='size' filepath='/build/libmpathutil/util.c' line='127' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='get_word' mangled-name='get_word' filepath='/build/libmpathutil/util.c' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_word@@NOVERSION'>
      <parameter type-id='type-id-36' name='sentence' filepath='/build/libmpathutil/util.c' line='85' column='1'/>
      <parameter type-id='type-id-52' name='word' filepath='/build/libmpathutil/util.c' line='85' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='get_next_string' mangled-name='get_next_string' filepath='/build/libmpathutil/util.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_next_string@@NOVERSION'>
      <parameter type-id='type-id-52' name='temp' filepath='/build/libmpathutil/util.c' line='75' column='1'/>
      <parameter type-id='type-id-36' name='split_char' filepath='/build/libmpathutil/util.c' line='75' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='filepresent' mangled-name='filepresent' filepath='/build/libmpathutil/util.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='filepresent@@NOVERSION'>
      <parameter type-id='type-id-36' name='run' filepath='/build/libmpathutil/util.c' line='67' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='basenamecpy' mangled-name='basenamecpy' filepath='/build/libmpathutil/util.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='basenamecpy@@NOVERSION'>
      <parameter type-id='type-id-36' name='src' filepath='/build/libmpathutil/util.c' line='49' column='1'/>
      <parameter type-id='type-id-9' name='dst' filepath='/build/libmpathutil/util.c' line='49' column='1'/>
      <parameter type-id='type-id-38' name='size' filepath='/build/libmpathutil/util.c' line='49' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strchop' mangled-name='strchop' filepath='/build/libmpathutil/util.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchop@@NOVERSION'>
      <parameter type-id='type-id-9' name='str' filepath='/build/libmpathutil/util.c' line='26' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' mangled-name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='getrlimit' mangled-name='getrlimit' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='setrlimit' mangled-name='setrlimit' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='write' mangled-name='write' filepath='/usr/include/unistd.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_once' mangled-name='pthread_once' filepath='/usr/include/pthread.h' line='470' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='strtol' filepath='/usr/include/stdlib.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='uname' mangled-name='uname' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtok' mangled-name='strtok' filepath='/usr/include/string.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin___snprintf_chk' mangled-name='__snprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__xstat' mangled-name='__xstat' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='opendir' mangled-name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir' filepath='/usr/include/dirent.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='closedir' mangled-name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_attr_init' mangled-name='pthread_attr_init' filepath='/usr/include/pthread.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_attr_setstacksize' mangled-name='pthread_attr_setstacksize' filepath='/usr/include/pthread.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_attr_setdetachstate' mangled-name='pthread_attr_setdetachstate' filepath='/usr/include/pthread.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__assert_fail' mangled-name='__assert_fail' filepath='/usr/include/assert.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' filepath='/usr/include/stdio.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strsep' mangled-name='strsep' filepath='/usr/include/string.h' line='440' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='basename' mangled-name='basename' filepath='/usr/include/string.h' line='487' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='debug.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <var-decl name='logsink' type-id='type-id-1' mangled-name='logsink' visibility='default' filepath='/build/libmpathutil/debug.h' line='12' column='1' elf-symbol-id='logsink@@NOVERSION'/>
    <var-decl name='libmp_verbosity' type-id='type-id-1' mangled-name='libmp_verbosity' visibility='default' filepath='/build/libmpathutil/debug.h' line='13' column='1' elf-symbol-id='libmp_verbosity@@NOVERSION'/>
    <function-decl name='dlog' mangled-name='dlog' filepath='/build/libmpathutil/debug.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlog@@NOVERSION'>
      <parameter type-id='type-id-1' name='prio' filepath='/build/libmpathutil/debug.c' line='23' column='1'/>
      <parameter type-id='type-id-36' name='fmt' filepath='/build/libmpathutil/debug.c' line='23' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='get_monotonic_time' mangled-name='get_monotonic_time' filepath='/build/libmpathutil/time-util.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__vfprintf_chk' mangled-name='__vfprintf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_safe' mangled-name='log_safe' filepath='/build/libmpathutil/log_pthread.h' line='6' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='time-util.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='10' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-82' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-82'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='196' column='1' id='type-id-83'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-84'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <function-decl name='timespeccmp' mangled-name='timespeccmp' filepath='/build/libmpathutil/time-util.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='timespeccmp@@NOVERSION'>
      <parameter type-id='type-id-85' name='a' filepath='/build/libmpathutil/time-util.c' line='53' column='1'/>
      <parameter type-id='type-id-85' name='b' filepath='/build/libmpathutil/time-util.c' line='53' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-86'/>
    <function-decl name='timespecsub' mangled-name='timespecsub' filepath='/build/libmpathutil/time-util.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='timespecsub@@NOVERSION'>
      <parameter type-id='type-id-85' name='a' filepath='/build/libmpathutil/time-util.c' line='45' column='1'/>
      <parameter type-id='type-id-85' name='b' filepath='/build/libmpathutil/time-util.c' line='45' column='1'/>
      <parameter type-id='type-id-86' name='res' filepath='/build/libmpathutil/time-util.c' line='46' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='normalize_timespec' mangled-name='normalize_timespec' filepath='/build/libmpathutil/time-util.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='normalize_timespec@@NOVERSION'>
      <parameter type-id='type-id-86' name='ts' filepath='/build/libmpathutil/time-util.c' line='32' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-87'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-88' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-89' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-90' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='92' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-92' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-92' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-92' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-91'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-55' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-93' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-4' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='64' id='type-id-92'>
      <subrange length='2' type-id='type-id-28' id='type-id-94'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='384' id='type-id-89'>
      <subrange length='48' type-id='type-id-28' id='type-id-95'/>

    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-90'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-87' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <function-decl name='pthread_cond_init_mono' mangled-name='pthread_cond_init_mono' filepath='/build/libmpathutil/time-util.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_cond_init_mono@@NOVERSION'>
      <parameter type-id='type-id-97' name='cond' filepath='/build/libmpathutil/time-util.c' line='16' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='get_monotonic_time' mangled-name='get_monotonic_time' filepath='/build/libmpathutil/time-util.c' line='6' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_monotonic_time@@NOVERSION'>
      <parameter type-id='type-id-86' name='res' filepath='/build/libmpathutil/time-util.c' line='6' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_condattr_init' mangled-name='pthread_condattr_init' filepath='/usr/include/pthread.h' line='1020' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_condattr_setclock' mangled-name='pthread_condattr_setclock' filepath='/usr/include/pthread.h' line='1045' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_cond_init' mangled-name='pthread_cond_init' filepath='/usr/include/pthread.h' line='965' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_condattr_destroy' mangled-name='pthread_condattr_destroy' filepath='/usr/include/pthread.h' line='1024' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='clock_gettime' mangled-name='clock_gettime' filepath='/usr/include/time.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uxsock.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <function-decl name='recv_packet' mangled-name='recv_packet' filepath='/build/libmpathutil/uxsock.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='recv_packet@@NOVERSION'>
      <parameter type-id='type-id-1' name='fd' filepath='/build/libmpathutil/uxsock.c' line='127' column='1'/>
      <parameter type-id='type-id-52' name='buf' filepath='/build/libmpathutil/uxsock.c' line='127' column='1'/>
      <parameter type-id='type-id-4' name='timeout' filepath='/build/libmpathutil/uxsock.c' line='127' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='send_packet' mangled-name='send_packet' filepath='/build/libmpathutil/uxsock.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='send_packet@@NOVERSION'>
      <parameter type-id='type-id-1' name='fd' filepath='/build/libmpathutil/uxsock.c' line='92' column='1'/>
      <parameter type-id='type-id-36' name='buf' filepath='/build/libmpathutil/uxsock.c' line='92' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ux_socket_listen' mangled-name='ux_socket_listen' filepath='/build/libmpathutil/uxsock.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ux_socket_listen@@NOVERSION'>
      <parameter type-id='type-id-36' name='name' filepath='/build/libmpathutil/uxsock.c' line='40' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mpath_recv_reply_len' mangled-name='mpath_recv_reply_len' filepath='../libmpathcmd/mpath_cmd.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='mpath_recv_reply_data' mangled-name='mpath_recv_reply_data' filepath='../libmpathcmd/mpath_cmd.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='mpath_send_cmd' mangled-name='mpath_send_cmd' filepath='../libmpathcmd/mpath_cmd.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin___memcpy_chk' mangled-name='__memcpy_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='sd_listen_fds' mangled-name='sd_listen_fds' filepath='/usr/include/systemd/sd-daemon.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='socket' mangled-name='socket' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='bind' mangled-name='bind' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='listen' mangled-name='listen' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='log_pthread.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <function-decl name='log_thread_stop' mangled-name='log_thread_stop' filepath='/build/libmpathutil/log_pthread.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='log_thread_stop@@NOVERSION'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_thread_reset' mangled-name='log_thread_reset' filepath='/build/libmpathutil/log_pthread.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='log_thread_reset@@NOVERSION'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_thread_start' mangled-name='log_thread_start' filepath='/build/libmpathutil/log_pthread.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='log_thread_start@@NOVERSION'>
      <parameter type-id='type-id-76' name='attr' filepath='/build/libmpathutil/log_pthread.c' line='104' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-26' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-99'/>
    <function-decl name='log_safe' mangled-name='log_safe' filepath='/build/libmpathutil/log_pthread.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='log_safe@@NOVERSION'>
      <parameter type-id='type-id-1' name='prio' filepath='/build/libmpathutil/log_pthread.c' line='25' column='1'/>
      <parameter type-id='type-id-36' name='fmt' filepath='/build/libmpathutil/log_pthread.c' line='25' column='1'/>
      <parameter type-id='type-id-99' name='ap' filepath='/build/libmpathutil/log_pthread.c' line='25' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_cancel' mangled-name='pthread_cancel' filepath='/usr/include/pthread.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_cond_signal' mangled-name='pthread_cond_signal' filepath='/usr/include/pthread.h' line='974' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='738' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_close' mangled-name='log_close' filepath='/build/libmpathutil/log.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_join' mangled-name='pthread_join' filepath='/usr/include/pthread.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_reset' mangled-name='log_reset' filepath='/build/libmpathutil/log.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_create' mangled-name='pthread_create' filepath='/usr/include/pthread.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='pthread_cond_wait' mangled-name='pthread_cond_wait' filepath='/usr/include/pthread.h' line='986' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_init' mangled-name='log_init' filepath='/build/libmpathutil/log.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' filepath='/usr/include/stdlib.h' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='mlockall' mangled-name='mlockall' filepath='/usr/include/x86_64-linux-gnu/sys/mman.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_dequeue' mangled-name='log_dequeue' filepath='/build/libmpathutil/log.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_syslog' mangled-name='log_syslog' filepath='/build/libmpathutil/log.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='log_enqueue' mangled-name='log_enqueue' filepath='/build/libmpathutil/log.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__vsyslog_chk' mangled-name='__vsyslog_chk' filepath='/usr/include/x86_64-linux-gnu/bits/syslog.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='log.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <class-decl name='logarea' size-in-bits='384' is-struct='yes' visibility='default' filepath='/build/libmpathutil/log.h' line='23' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='empty' type-id='type-id-1' visibility='default' filepath='/build/libmpathutil/log.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-26' visibility='default' filepath='/build/libmpathutil/log.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tail' type-id='type-id-26' visibility='default' filepath='/build/libmpathutil/log.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='start' type-id='type-id-26' visibility='default' filepath='/build/libmpathutil/log.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='end' type-id='type-id-26' visibility='default' filepath='/build/libmpathutil/log.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buff' type-id='type-id-9' visibility='default' filepath='/build/libmpathutil/log.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <var-decl name='la' type-id='type-id-101' visibility='default' filepath='/build/libmpathutil/log.h' line='32' column='1'/>
    <function-decl name='__syslog_chk' mangled-name='__syslog_chk' filepath='/usr/include/x86_64-linux-gnu/bits/syslog.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin___vsnprintf_chk' mangled-name='__vsnprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='closelog' mangled-name='closelog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='openlog' mangled-name='openlog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strbuf.c' comp-dir-path='/build/libmpathutil' language='LANG_C99'>
    <function-decl name='print_strbuf' mangled-name='print_strbuf' filepath='/build/libmpathutil/strbuf.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_strbuf@@NOVERSION'>
      <parameter type-id='type-id-39' name='buf' filepath='/build/libmpathutil/strbuf.c' line='195' column='1'/>
      <parameter type-id='type-id-36' name='fmt' filepath='/build/libmpathutil/strbuf.c' line='195' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='append_strbuf_quoted' mangled-name='append_strbuf_quoted' filepath='/build/libmpathutil/strbuf.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='append_strbuf_quoted@@NOVERSION'>
      <parameter type-id='type-id-39' name='buff' filepath='/build/libmpathutil/strbuf.c' line='155' column='1'/>
      <parameter type-id='type-id-36' name='ptr' filepath='/build/libmpathutil/strbuf.c' line='155' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fill_strbuf' mangled-name='fill_strbuf' filepath='/build/libmpathutil/strbuf.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fill_strbuf@@NOVERSION'>
      <parameter type-id='type-id-39' name='buf' filepath='/build/libmpathutil/strbuf.c' line='141' column='1'/>
      <parameter type-id='type-id-24' name='c' filepath='/build/libmpathutil/strbuf.c' line='141' column='1'/>
      <parameter type-id='type-id-1' name='slen' filepath='/build/libmpathutil/strbuf.c' line='141' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='append_strbuf_str' mangled-name='append_strbuf_str' filepath='/build/libmpathutil/strbuf.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='append_strbuf_str@@NOVERSION'>
      <parameter type-id='type-id-39' name='buf' filepath='/build/libmpathutil/strbuf.c' line='127' column='1'/>
      <parameter type-id='type-id-36' name='str' filepath='/build/libmpathutil/strbuf.c' line='127' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
